/*
Navicat MySQL Data Transfer

Source Server         : MySQL8
Source Server Version : 80025
Source Host           : localhost:3306
Source Database       : music_c

Target Server Type    : MYSQL
Target Server Version : 80025
File Encoding         : 65001

Date: 2023-11-24 12:56:59
*/

SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for album
-- ----------------------------
DROP TABLE IF EXISTS `album`;
CREATE TABLE `album` (
  `album_id` int NOT NULL AUTO_INCREMENT COMMENT '专辑编号',
  `singer_id` int NOT NULL COMMENT '歌手编号',
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '专辑名称',
  `time_of_issue` datetime DEFAULT NULL COMMENT '发行时间',
  `company` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '发行公司',
  `introduce` varchar(10240) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '介绍',
  `img` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '专辑封面',
  `type_id` int DEFAULT NULL COMMENT '种类id',
  PRIMARY KEY (`album_id`),
  KEY `singer_id` (`singer_id`),
  KEY `type_id` (`type_id`),
  CONSTRAINT `album_ibfk_1` FOREIGN KEY (`singer_id`) REFERENCES `singer` (`singer_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `album_ibfk_2` FOREIGN KEY (`type_id`) REFERENCES `album_type` (`type_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=34 DEFAULT CHARSET=utf8mb3 COMMENT='Album专辑实体类';

-- ----------------------------
-- Records of album
-- ----------------------------
INSERT INTO `album` VALUES ('1', '2', '不如吃茶去', '2014-08-23 17:16:28', '海蝶', '关于爱恨情仇的道理，关于人生的感悟，我们说了那么多，也听了那么多，最后又如何？\r\n\r\n有诗云:空持百千偈，不如吃茶去。这是前人流传下来的禅机，是许嵩心向往之的怡然与从容，更是他第五张全创作专辑希望传达的生活态度。\r\n\r\n大千世界，多得是想不通的事，多得是猜不透的心，多得是看不透的人。不如不想，不如不猜，不如不看，不如寄情山水，不如快意人生，不如，吃茶去。——许嵩\r\n\r\n在前四张全创作专辑收获了一长串的乐坛奖项与听众认可之后，许嵩对待演艺工作依然保持着若即若离的状态，为创作留足空间与时间。近两年的时光，除了常规演出之外，他选择了将生活的大部分内容转向旅行，读书，进修，创作摄影随笔集，以及创作制作本张专辑。“不如吃茶去”像一句随性的口头禅，而这份悠游自在，正是他真实的生活状态。他是音乐人之中的文人，还是文人之中的音乐人，或许这些定义对他而言已不重要。他的平和、干净、低调，是经过了时间检验的个人特质，这样的个性注定与娱乐绝缘，但又恰恰是乐迷最为欣赏的特质。本辑中充满中国古典气息的词作再次展现了许嵩强大的笔力与深厚的古典文学修养。近两年许嵩常在大山大河间旅居，所到一处觉得清凉自在了，就小住十天半月，吃茶，读书，抚琴，会友，呼吸山岚清气，远离喧闹的都市文明，以更为清净的心去体悟生活，由此创作出一系列清润如茶的音乐作品。本辑中有诸多精彩佳句均是在幽居之时的灵光闪现。当回到北京，回到严谨的工作状态时，他第五次掌控全局，身兼本专辑音乐总监、全部词曲的创作者、制作人的身份，更亲力亲为操刀编曲与混音工作。从创作词曲开始，到编曲、监制编曲，再到现场录制各样乐器，完成混音与母带制作，每首作品平均包含两百多轨乐器素材，总计近两千轨，均由许嵩一手包办制作，在工作室内醉心本辑制作的总时间超过一千五百小时，全身心为音乐注入情感和能量。\r\n\r\n《不如吃茶去》是充满碰撞火花的一体：东方的清音雅乐，西方的律动节奏，交织并进；披着古色古香的外套，内里却是一颗极为现代的精神内核；既书写怡然洒脱的态度，也不掩内心的感伤离愁，生活五味熔于一炉。遣词造句是许嵩式的美学，不经意间抖落的词趣与禅机耐人寻味。你眼前浮现的是一个老成的少年，有故事，但绝不沧桑，他低吟浅唱着把他的故事讲给你听，无论故事是悲或喜，都讲得饶有情致，作者的迷人之处也恰在这里。这样的音乐让人难于定义，它像是属于从今天到过去几百年中的任何一个时段：古典与流行交织，让听者在不知不觉间忘却了所处的时代。\r\n\r\n作为一张穿梭古今的作品，《不如吃茶去》集结了多位优秀的中国民乐演奏家：古筝、竹笛、箫、尺八、埙、古琴、二胡、马头琴等乐器，各路大师以教材级别的绝妙演奏为专辑增光添彩。但精彩并未到此为止，许嵩在本辑中的乐思并不停步于中国民乐，而是以丰富多元的音乐语言表达专辑概念。于是，我们在《弹指一挥间》中聆听中国国家交响乐团恢宏而深沉的弦乐演奏；在《梧桐灯》里邂逅世界上最古老的乐器都都克笛 （Duduk）如泣如诉的天籁之音，与Trip-Hop节奏融为一体；《等到烟火清凉》着意于氛围渲染，渐进铺陈情绪，高潮充满震撼力，八字唱词禅意深远；《山水之间》里一段古筝与爵士吉他齐奏，行云流水般交相辉映，演奏技巧在流行乐中甚为罕见；《隐隐约约》将迷幻的电子音色与马头琴、失真吉他奇妙混搭，氛围诡谲奇异,彰显许嵩卓绝的编曲想象力；《惊鸿一面》与魅力歌姬黄龄深情演绎令人心向往之的古典式爱情；《宇宙之大》以印度传统乐器西塔尔琴作点缀，营造虚空幻境；《有桃花》加入传统民歌采样，温馨小曲令人动容……随处可见的精妙构思匠心独运，加上华语乐坛顶级阵容的编曲搭档们倾力助阵，《不如吃茶去》注定成为不可错过的精品佳作。\r\n\r\n在音乐之外，本辑的MV由台湾著名导演黄中平先生操刀。MV拍摄生涯超过二十年、拍摄过数百位歌星的他破天荒接下了同一张专辑中的三首MV拍摄工作以及部分摄影工作，上山下海旅途奔波长达数十日，背负超大的工作量只为完美呈现许嵩作品中超凡脱俗的意境。本辑的内页写真则由知名摄影家张罗平先生拍摄，作为曾与许嵩多次合作的伙伴，张罗平的摄影精准展现许嵩的个性特质。本辑的装帧设计则邀请到曾入围格莱美奖的台湾顶级设计师萧青阳老师出手，简约大气的设计风格毫无造作修饰，贴合专辑返璞归真的音乐主题。', 'music/2/1/1.jpg', '1');
INSERT INTO `album` VALUES ('2', '2', '不语', '2016-03-03 17:16:28', '海蝶', '晴朗不语 阴天不语\r\n\r\n坚强不语 脆弱不语\r\n\r\n那些习惯沉默不语的人\r\n\r\n内心的火焰可能更炽烈\r\n\r\n \r\n\r\n2016最新悬疑影片《不速之客》，汇集黎明、耿乐、韩彩英等重量级演员而成为年度极受期待的电影，力邀许嵩跨刀演绎电影主题曲《不语》。\r\n\r\n \r\n\r\n《不语》由火星电台创作，如诗般简洁而深远的歌词，钢琴与弦乐搭配的古典质感，契合影片意境。片方听过歌曲小样后第一感觉邀请许嵩来演绎会极为合适，然而工作人员上网搜索资料发现许嵩几乎只演唱其自己原创的作品，于是就放弃了这个想法。随后的时间里，片方邀约了其他几位歌手试音，歌手不约而同表示这首歌写得看似简单，实则非常难于演绎：副歌不断重复追问，如何表达的有层次但不落俗套是个难题。试音后发现效果不太理想。抱着试试看的态度，片方联系了许嵩所属唱片公司，没想到许嵩素来对悬疑电影题材非常喜爱，愿意尝试演绎本影片主题曲，双方一拍即合。\r\n\r\n \r\n\r\n许嵩除歌手身份外，更以词曲创作而为听众所知晓，作品题材丰富，是集词、曲、唱及音乐制作于一人的全能型音乐人。而此次不动笔墨仅以歌声出演，便将作品中的那份隐秘心事娓娓道来：寂寥，隐忍，迷走，自我追问……逐层推进，丝丝入扣。沉稳而细致的演绎，独占了一份只属于许嵩的个人风味。', 'music/2/2/2.jpg', '1');
INSERT INTO `album` VALUES ('3', '2', '书香年华', '2016-02-25 17:16:28', '海蝶', '《书香年华》本是应央视邀请而创作的主题音乐，意在鼓励小朋友们勤读经典书籍，进而弘扬中华民族传统文化，许嵩也以轻快的曲风并带着自我调侃的笔触完成了这首新歌，打造出不带说教味又充满正能量的歌曲，令央视的编导们耳目一新，非常喜爱，并将这首作品推荐给了猴年春晚，虽然遗憾未能在春晚舞台表演新歌，但在2016中央电视台元宵晚会，许嵩再次受到邀请演绎这首作品，并创意性的增加跨界合作，邀请著名演员孙涛合唱。孙涛多次登上央视春晚表演小品节目，实力笑星的加盟也为这首非常正能量的歌曲增加了节庆的轻松氛围。', 'music/2/3/3.jpg', '1');
INSERT INTO `album` VALUES ('4', '2', '今年勇', '2016-12-22 17:16:28', '海蝶', '近来发行第六张创作专辑《青年晚报》及单曲《江湖》大获好评后，许嵩接着发行了最新单曲作品《今年勇》。\r\n\r\n常言道：“好汉不提当年勇。”那什么才值得取得过战绩的好汉们提上一提？许嵩造了个词儿作答——今年勇。前奏一响起便显露出全新气象，好莱坞配乐风格的弦乐与中国大鼓齐头并进，中西合璧，富有故事性。随性的演唱，也契合了歌词里所表达的那份洒脱：站在今时，立足当下，面对新的挑战要拿得出勇气与冲劲，而不是吃老本抑或轻易地激流勇退。\r\n\r\n许嵩笔下，复古风味的佳作颇多，但为人称道的是他在这类复古作品里所探讨的主题非常开阔：《庐州月》的思乡，《半城烟沙》的止战，《清明雨上》的悼亡，《江湖》的侠骨，《南山忆》的隐逸，《山水之间》绘景，《伴虎》的君臣之道，《惊鸿一面》的你侬我侬……各有各的精彩。《今年勇》亦是在考究的字句中见功夫，例如，“醉庆同袍沙场归”的酣畅之后，整个人感到“清风皓月任我飞”，寥寥数语便道尽豪杰之士的那份落拓不羁；短短一首词有四处使用否定句式：“不见得”、“不代表”、“不足道”、“功成身不退”，引出一系列全新的反向思考；开篇道：“功名桥，世俗道，年少难免走一遭”，接着话锋一转：“笑的也不见得逍遥”——取得功名业绩并不等于幸福。这样的弦外之音奠定了作品的格局——今年要勇，明年要勇，老去亦要勇，这份勇并不是为世俗功名而战，而是人在每一个阶段都应该活出足够的生命强度。', 'music/2/4/4.jpg', '1');
INSERT INTO `album` VALUES ('5', '2', '千古', '2015-08-20 17:16:28', '海蝶', '故事的甘或是苦\r\n\r\n如果没有你 何人可诉\r\n\r\n流芳或是贻笑千古\r\n\r\n如果没有爱 有何不同\r\n\r\n \r\n\r\n许嵩作品《千古》，由许嵩词曲创作及制作。有别于上张专辑里《山水之间》式的华丽古韵，许嵩在《千古》里擦除了年代感，以干净利落、清朗质朴的音乐语言，描摹对爱情的感伤与眷恋，也营造了更为开阔的赏味格局。词作方面，微微带有文言气息的现代文法，细腻与洒脱并存，字里行间满溢许嵩的个人风格，见字如面。\r\n\r\n \r\n\r\n2015年许嵩凭借热门专辑《不如吃茶去》收获了多个创作大奖，而除了重大典礼活动外则鲜少露面，绝大部分时间埋首于他的新专辑制作工作，这引发了部分乐迷的“不满”，连连在他的微博“催专”、求新歌。据了解新专辑制作顺利进行中，预计于第四季度发表。', 'music/2/5/5.jpg', '1');
INSERT INTO `album` VALUES ('6', '2', '半城烟沙', '2010-04-11 17:16:28', '安徽音像', '许嵩2010年独立创作发行的专辑《寻雾启示》正在街头巷尾热力传播着，而眼下《半城烟沙》又已席卷而来，一会儿烟一会儿雾的许嵩总是让人捉摸不定。他每每下笔写复古题材，总是会把准一个文化脉象，无一不是历史文化诉之不尽的文化命题。而这首《半城烟沙》则把思辩的主题落到了「战」与「和」之上，别具禅意。音乐方面，强节奏+独门唱法已经成为招牌；不愠不火、不动声色的演绎，以悢懒的帝观姿态静待一场一触即发的厮杀，愈加凸显战争的冰冷残酷，而作者的反战立场也尽在歌中了。独特的视角、悲悯的情怀、含蓄内敛的表现手法，很难不给人留下深刻印象。', 'music/2/6/6.png', '1');
INSERT INTO `album` VALUES ('7', '2', '天龙八部之宿敌', '2011-09-20 17:16:28', '海蝶', '2011年金秋时节。在加盟海蝶后，逐渐显露天王气质的许嵩，不仅新专辑销量一路高歌，更是以天价数字接下了搜狐畅游公司旗下最新网络游戏《天龙八部3》的年度代言人。基于该公司上一代产品主题曲《半城烟沙》就出自许嵩之手，并且大获成功。这款拥有无数玩家基础的网络游戏最新代主题曲的打造，也非许嵩莫属。这次许嵩依旧中国风词曲全创作，并领衔林哲民、蔡庭贵、等两岸乐坛主心骨。一起合力为新歌加持力量。也使得该歌还未首播，就获得了无数乐迷的翘首期待。', 'music/2/7/7.jpg', '1');
INSERT INTO `album` VALUES ('8', '2', '如果当时2020', '2020-11-11 17:16:28', '', '', 'music/2/8/8.png', '1');
INSERT INTO `album` VALUES ('9', '2', '寻宝游戏', '2018-07-12 17:16:28', '海蝶', '2018年许嵩最新作品《寻宝游戏》，许嵩第7张词曲全创作专辑。\r\n\r\n \r\n\r\n你我他她一生在世，寻寻觅觅各有所求，人人心中皆有秘密宝藏。许嵩在《寻宝游戏》中以松弛、真实的笔触书写对生活的体悟以及对世态的思考，寻访人心、玩味世情。\r\n\r\n \r\n\r\n《寻宝游戏》的语言系统中充满着多义与辨证，让读者在聆听的过程中不知不觉沉浸于许嵩构建的这一场头脑游戏，富有诗性与灵气的文字挑战歌词创作新高度。他的文字里时而带着严谨理性的刚硬质地，但细听之下又可体会他的幽默与柔软——这份既刚又柔、亦庄亦谐的矛盾感形成了某种难以言喻的、专属于许嵩的艺术效果。\r\n\r\n \r\n\r\n在《寻宝游戏》里许嵩以极致复古的音乐语言带领听者回到20世纪60-80年代，融合Blues-Rock、Country-Rock、Folk-Rock、Electronic-Rock、Jazz等根源性音乐风格，加以最新锐的制作理念打造当代音乐精品，既复古，又超前。他旧时明月般的老灵魂，总是能找到极其鲜活的表达方式来完成情感与观点的输出。整张专辑音乐类型多元化却又统一于许嵩强大的音乐制作和统筹功力，在听觉层面达到了惊人的一体性。许嵩以松弛自然的演唱方式唱出独属于他的腔调与态度，无可拷贝。音乐里精心设置的诸多细节伏笔也有待听者去开掘玩味，这是《寻宝游戏》所引发的寻宝游戏。\r\n\r\n \r\n\r\n《寻宝游戏》的平面相片及音乐录影带拍摄于美国纽约及美国西海岸地区。二十余人团队同许嵩一起出发，海外拍摄花费长达半个月的时间。专辑封面相片拍摄于美国西海岸地区1号公路，牛仔青年，开启寻宝之旅。以橙色为主色的美式唱片装帧，在复古中加入摩登元素，设计考究。专辑曲目《老古董》、《大千世界》、《如约而至》的音乐录影带摄于纽约，由台湾著名MV导演比尔贾执导，影像画面寓意丰富，余味悠长。\r\n\r\n \r\n\r\n《寻宝游戏》专辑概念由许嵩一手打造，并且每首曲目的词曲创作、音乐制作均由许嵩独自完成。至今为止许嵩已一人作词、作曲、演唱、制作、策划7张个人专辑，这份成绩与其全方位的音乐才华在华语乐坛是独树一帜的。2018年是许嵩进入公众视野的第十二年，成功发行7张词曲全创作专辑以及近40首原创单曲，勤勉专注于音乐创作；屡获国内外各大华语音乐颁奖典礼奖项，拥有突破十亿次的数字音乐下载量，影响力强大；2017年开启万人巡演，场场爆满座无虚席，从头至尾全程万人大合唱；在斐然的成绩面前，许嵩始终远离喧嚣保持低调姿态，只靠作品说话，在《寻宝游戏》里进一步展现了广阔的音乐视野与深厚的人文积淀。', 'music/2/9/9.jpg', '1');
INSERT INTO `album` VALUES ('10', '2', '寻雾启示', '2010-01-06 17:16:28', '华宇世博', '2009，2008，2007……你可能在街头听过许嵩的歌，在各种音乐排行榜上见过许嵩这个名字，看到过年轻人一脸兴奋的讨论着“Vae”、“自定义”，但你不一定知道，这不是什么唱片公司打榜、宣传所产生的效果，而是完全靠着乐迷口口相传的力量，这股力量已经延续了近三个年头，并且正在持续蔓延中。\r\n\r\n他拒绝签约唱片公司，独立完成个人专辑的创作、制作及发行。他绝对是内地近年来网络人气最高的独立音乐人，没有之一。他是内地乐坛的一个异数。\r\n\r\n2010年1月发行的最新作品《寻雾启示》是他的个人第二辑。和2009年1月发行的首张专辑《自定义》一样，他一人担任了整张唱片的作词、作曲及制作人——大到整张专辑的风格定位，小到每一首歌的和声编配、乐器音色选用、录音混音，大大小小所有环节都在他掌控之中。\r\n\r\n听许嵩的创作，总能让人体会到前所未有的音乐灵感，总能让人在细枝末节处找到直击人心的感动。在这张《寻雾启示》中，刚柔并济的曲风搭配、率性洒脱的行文作词，自居一格的演唱方式，都让人感受到一种无可拷贝的气场。这是一张游走在「复古 / 新锐」、「嬉皮 / 深情」、「回忆 / 现实」、「深度 / 流传度」之间的作品，对以上要素恰到好处的分寸把握，再一次证明了23岁的他已经拥有强大制片功力。\r\n\r\n乍听到“寻雾启示”这个名字，还以为是寻物启事。其实，我们每个人都在生活中寻找着，又在寻找中生活着；身边很多看似美丽的事物和雾一样，看得见却让人抓不住；所谓人生的进阶与历练，可能正是要在经历得失与悲喜之后，方能得到启示。\r\n\r\n听《寻雾启示》，是非常容易陷入某种情绪的。你要知道，音乐一旦对了味，俘获人心的力量有多大。\r\n\r\n01.叹服 词/曲：许嵩\r\n\r\n招牌式黑色作品。爱情里的所有忠诚与信仰化作一片雾气，让天下多少有情人在一路追寻过后，只留下阵阵唏嘘。\r\n\r\n02.灰色头像 词/曲：许嵩\r\n\r\n当一段本身已足够伤感的回忆被挖掘到了极致，却发现所有的回忆竟是一团雾，一场梦……充满回忆感的吉他滑音、电钢solo，慵懒而不失弹性的深情演绎，是为慢板抒情R&B之上品。\r\n\r\n03.我无所谓 词/曲：许嵩\r\n\r\n玩世不恭却又透出几分认真的一首RAP，那种嬉皮劲儿是能让人会心一笑的。\r\n\r\n04.庐州月 词/曲：许嵩\r\n\r\n作者化身一位古代出仕者，思考着功名利禄的虚妄、感叹着物是人非的苍凉、抒发着远离故乡的怅惘，可谓各种细腻熔于一炉。慢板的6/8R&B节奏引领出一个个章节，一幅幅古典画面自然而然呈现在你眼前。\r\n\r\n05.不煽情 词/曲：许嵩\r\n\r\n名为不煽情，但却很是煽动人心的一首叙事小品。许嵩从头至尾采用了口语对话的笔法，极富表现力的双吉他演奏陪伴着歌声，描摹出一场爱情的淡然落幕。\r\n\r\n06.我们的恋爱是对生命的严重浪费 词/曲：许嵩\r\n\r\n歌名很长很直白，歌曲也非常直截了当。热烈却不轻浮的Rock编曲以及随性奔放的演唱都很令人惊艳，亦让人领略到许嵩的多面。\r\n\r\n07.白马非马 词/曲：许嵩\r\n\r\n以哲学命题为名展开思考。大胆采用纯钢琴伴奏+几近清唱的混音方式，细枝末节如此凸显，连每一声换息都牵动人心。\r\n\r\n08.单人旅途 词/曲：许嵩\r\n\r\n失恋者快意洒脱的单身宣言，往往都带着些酸；“自由”不过就是一团雾，一个幌子，远远看起来很美，真正身处其间拥有了，却又觉着寂寞。这首中板R&B里面的情味比起它里面的转音，更为复杂。\r\n\r\n09.在那不遥远的地方 词/曲：许嵩\r\n\r\n梦想就在不遥远的地方——虽然，在得到之前，我们并不能确定它是否是幻想。电子音色与中国民乐混搭、开阔大气的词风、行云流水般的光滑人声、多层次对话式和声恰到好处的运用，组成了这首极具实验性的跨界混搭励志曲。', 'music/2/10/10.png', '1');
INSERT INTO `album` VALUES ('11', '2', '小烦恼没什么大不了', '2013-05-20 17:16:28', '海蝶', '自推出上张全创作大碟取得骄人成绩后，许嵩就一度被歌迷“催生”新作品，本次推出的新歌《小烦恼 没什么大不了》先放出片段给歌迷“解馋”，却反倒吊起歌迷胃口，大呼只听片段一点也不过瘾，还纷纷猜测许嵩接下来会用怎样的方式与歌迷互动。', 'music/2/11/11.png', '1');
INSERT INTO `album` VALUES ('12', '2', '情侣装', '2008-01-15 17:16:28', '', '年仅21岁的网络红人Vae（许嵩），在现身网络的两年内，凭借《七号公园》《浅唱》《玫瑰花的葬礼》等大量原创作品受到海量网友的喜爱，屡获各大门户网站评选出的最佳网络男歌手、最佳词曲作者等大奖。曾荣获罗马尼亚国际通俗音乐比赛亚军，亚洲音乐节通俗音乐比赛新人大奖。值得一提的是，Vae不仅精通作词、作曲、编曲，所有作品的录音与后期混音工程也均由其独立完成，可见Vae全方位的音乐能力与极高的音乐素养。 VAE对《别咬我》这首歌的看法 物是人非的时候，回忆就会显示它可爱而又残忍的一面。虽然生活中的事一件接着一件，欢畅的，莫名的，卑劣的，让人应接不暇，但是记忆总是会自动筛选出某些事，供我在日后抚摩把玩，这些事，被叫做典故。最近发生了一些事，直接触发我记忆的阀门，典故如洪水一般涌出，让我在这样的转凉时节，有些不知所措。', 'music/2/12/12.png', '1');
INSERT INTO `album` VALUES ('13', '2', '我乐意', '2018-04-19 17:16:28', '海蝶', '近日，许嵩忙于第七张个人创作专辑的最后阶段工作，\r\n\r\n与此同时推出全新单曲《我乐意》，\r\n\r\n作为新专辑发布前的暖身礼物，回馈歌迷。\r\n\r\n《我乐意》由许嵩包揽词曲创作及制作。\r\n\r\n响指、五把吉他与淡淡的电子音色一齐营造出清新校园味道；\r\n\r\n回归到了至简至朴的情书式歌词，\r\n\r\n比如“你的笑像西瓜最中间那一勺的口感”，令整首作品漫溢着恋爱清甜；\r\n\r\n许嵩独有的慵懒随性的演绎方式，\r\n\r\n一如歌词里所言——“我绝不会深情款款”，\r\n\r\n令整首歌听来甜而不腻，甜度恰到好处。\r\n\r\n许嵩在个人APP里发帖戏称这一次的创作是“老来俏”，\r\n\r\n可见“玩音乐”的开放心态始终不改，各种曲风信手拈来。 \r\n\r\n在歌曲制作环节许嵩亦亲力亲为，制作出多个版本反复比较，\r\n\r\n最终发行版本删减了若干乐器声部，\r\n\r\n“让这首歌听起来简洁轻盈才对味”，许嵩这样说。\r\n\r\n在混音时许嵩有意对歌曲高频部分进行细微降频处理，\r\n\r\n令整首作品听起来更加温暖无刺激，适合循环播放。\r\n\r\n母带处理环节则放弃了在音量响度方面的竞争，\r\n\r\n以80’s唱片的音量标准来处理这首歌的母带，\r\n\r\n以此换取了歌曲动态起伏的弹性。\r\n\r\n每个环节精雕细琢，只为打造出词、曲、唱、制作四位一体的优质音乐作品。', 'music/2/13/13.jpg', '1');
INSERT INTO `album` VALUES ('14', '2', '我想牵着你的手', '2008-04-22 17:16:28', '唯亿文化', '《我想牵着你的手》 曾被改编为联想乐Phone广告背景音乐', 'music/2/14/14.png', '1');
INSERT INTO `album` VALUES ('15', '2', '放肆', '2020-10-12 17:16:28', '海蝶音乐', '许嵩最新作品《放肆》于2020年10月12日零点发行，由许嵩作词、作曲及制作。\r\n\r\n此次的国风新作以豪放不羁的姿态呈现，散发出不同于许嵩任何前作的独特气息。许嵩以极具创造性的细腻笔触在百余字内构建描摹一位孤身独心的浪迹之人在塞外酒馆中的放肆故事。吞吐日月的落拓豪情，在半醉半醒间烧燃起心中火焰。\r\n\r\n《放肆》的创作制作周期前后横跨了四个月，对许嵩来说这并不寻常，期间工作人员不断打听进度，但得到许嵩回复：“还请再等等。”结果成品出来后大家兴奋不已：超燃的节奏律动，粗粝而酣畅的演绎方式，戴好耳机听《放肆》，会不由自主踏出六亲不认的放肆步伐！\r\n\r\n《放肆》是游戏《天龙八部》邀约许嵩打造的第四首主题单曲，而前三首历经十年的时间跨度，已成为乐迷们耳熟能详的经典，时间检验出真正的优秀创作者。许嵩总在不断开拓创作边界，多元化的个人音乐风格展现了强大的创作力。而无论是《放肆》的侠骨，还是《宿敌》、《雨幕》的柔情，这些风格迥异的作品都统一于许嵩具有极强辨识度的个人语言系统，统一于许嵩心中的武侠宇宙。\r\n\r\n单曲主题封面由摄影家张罗平拍摄。面对多年合作伙伴的镜头，许嵩轻松释放个性中放肆不羁一面，很快便顺利拍完。对于这次特别的曲风，封面如何拍摄才能画龙点睛是个难点，因为如果穿上古装、完全重现歌中场景，则不够吻合音乐里武侠与摇滚乐融合、东西合璧的独特质感。最终大家决定以自然而然的方式表现出“放肆”之感就是最好的。许嵩更是临时请工作人员找来一个油灯摆在手边，之后还设法让火焰看起来大到离谱，以示“不是省油的灯”。', 'music/2/15/15.jpg', '1');
INSERT INTO `album` VALUES ('16', '2', '断桥残雪', '2007-12-28 17:16:28', '海雷音乐', '《断桥残雪》是由许嵩作词作曲并演唱的歌曲。', 'music/2/16/16.png', '1');
INSERT INTO `album` VALUES ('17', '2', '梦游计', '2012-07-11 17:16:28', '海蝶', '这城市\r\n\r\n太多形色匆匆的人\r\n\r\n有太多事情要做……\r\n\r\n那追逐 那较量 那欲望\r\n\r\n是在梦里都放不下的我执\r\n\r\n谁都自以为看透了现世\r\n\r\n但谁又真的想离开\r\n\r\n如果白昼注定以奔忙来填满\r\n\r\n梦中就请以畅游来救赎\r\n\r\n邀你参与，一场精心策划的出离。\r\n\r\n——2012/7/11 · 许嵩第四部作品「梦游计」\r\n\r\n浮华的现代都会，人与人、事与事之间千丝万缕的纠葛，使得白天总在上演着一场场追逐欲望的脑力较量。但回归到一个人的深夜，可否大胆借梦游一场，作为逃离一切束缚的妙计？在梦游的领域，抛开压力与顾虑，站在自己之外看自己，重新审视自己与他人、自己与世界的关系——超现实主义作品《梦游计》将提供这样的可能性。作者以敏锐的洞察力，天马行空的想象，出其不意的运笔，自成一派的音乐理念，邀你完成一场梦游式的出离。\r\n\r\n第四部作品《梦游计》，许嵩依然包揽十首词曲的创作、担当制作人及唱片统筹，用一整个25岁锤炼独立音乐作品新范本，再一次展现了惊人的音乐能量。后期环节中携手许环良、林哲民、蔡庭贵、杨阳、陈伟伦等一线配乐人与混音大师，在他的工作室磨合切磋了上百个日夜，精益求精，只为上演完美“梦游计”。视觉方面，平面写真融入超现实主义元素，以虚实相生的表现手法呈现“梦游”情境；MV奔赴台湾打造专属于《梦游计》的梦游诡谲风格；比尔贾、黄中平、方亮等众多视觉创意高手前来加盟，联手奉上独具梦游滋味的眼球盛宴。你将领略这样的许嵩，嬉皮又文雅的，迷离又真实的，戏谑感十足却充满诚意的。\r\n\r\n许嵩说，整部作品的创作概念本就源于一场梦。他在那梦里游走，超脱于现实，却得以更真实的触碰现实；他把他所历经的一切，摊开来给你看。\r\n\r\n＊ 全碟十首作词+作曲+制作，许嵩第四次展现强大音乐能量\r\n\r\n＊ 2009-2012连续发表四张词曲全创作专辑，笔耕不辍，佳作连连\r\n\r\n＊ 2011年凭《苏格拉没有底》成为内地唱片销量王，获得国内外共计9项音乐大奖\r\n\r\n如果你对他的音乐还不了解，那么《梦游计》是一场很好的初见；如果你是他的音乐追随者，那么《梦游计》将第四次印证你的选择。\r\n\r\n＊单曲介绍\r\n\r\n01. 胡萝卜须\r\n\r\n法国黑色童话《胡萝卜须》里的那个红头发少年，盯着自己亲手摔碎的鼹鼠，任由它的血花在空中飞扬……\r\n\r\n你未必没有暗暗释放过——扭曲的、荒诞的、隐藏在你道德外衣下的暴力。\r\n\r\n因为你一定暗暗接收过——傲慢的、偏狭的、让你愤懑却也令你成长的眼神。\r\n\r\n谁 可记取几桩童年旧梦\r\n\r\n谁 又深藏几段残破青春\r\n\r\n谁 能说自己不是胡萝卜须\r\n\r\n《胡萝卜须》由许嵩作词、作曲及制作，是他第四部独立作品《梦游计》的开篇序曲。作为大陆词人中的新锐标杆人物，许嵩向来以笔法的大胆与视角的独特见长。此次新歌以法国文学名作《胡萝卜须》的主人公为切入点，运笔穿梭于梦样童话与冰冷现实之间，在“自我”与“胡萝卜须”两端来回切换，令人读罢笑中有泪；音乐方面，许嵩创作极具西洋色彩的半音阶旋律线，并创意性的融入探戈节奏，在手风琴与萨克斯的呼应之下自然而然地散发出异域风情；标志性的“懒人唱腔”此番亦演绎至极致，梦游般慵懒而又充满戏谑的独特诠释，令《胡萝卜须》的黑色幽默在短短的三分多钟里无限扩张。词、曲、唱、制的四者合一，给他的作品打上了鲜明的个人烙印。知名导演比尔贾掌镜MV，以寓意巧妙的视觉语言展现胡萝卜须的精神世界，打造出专属于《梦游计》的超现实主义诡谲风格。\r\n\r\n02. 幻听\r\n\r\n「 在远方的时候 / “又想你到泪流” / 这矫情的措辞结构 / 经历过的人会懂 」\r\n\r\n你是否幻听过你的前度在你耳边低语？\r\n\r\n当你发现那不过是一场幻觉，不过是自己大脑制造出的假相——你是否仍还希望那假相能持久一些？\r\n\r\n很多时候，回归现实真不如躺在幻觉里永不醒来……\r\n\r\n真诚质朴的遣词造句，精致纯美的旋律，感性细腻的演绎，给人带来最原始的感动。配乐方面，一把吉他、几声鼓点，淡淡的抒情慢板R&B曲风，纯粹到极致，也深情到极致；知名MV导演黄中平与许嵩再度合作，以幻梦风格呈现他笔下的这场“极致爱情”。\r\n\r\n“如果一个人被魔鬼深深凝视过了，那么他的眼睛就会瞎掉。\r\n\r\n如果一个人被这首歌轻轻带入了，他的耳朵会幻听。”\r\n\r\n03. 对话老师\r\n\r\n「 我写检讨的文采不到写情书的一半 / 你做学问的本领有没五柳先生一半 」\r\n\r\n淘气的闯祸，早恋的情愫，焦急盼望的下课声，害怕家长发现的不及格考卷……念书时发生过很多让自己脸红的故事吧？\r\n\r\n但，那不正是长大后的心中最美好的那些年？\r\n\r\n许嵩梦回学生时代，信手拈来一曲校园小品，幽青春一默，也幽老师们一默。\r\n\r\n04. 伴虎\r\n\r\n「 谁能以为 / 同朝可同寐 」\r\n\r\n历史的车轮碾过，多少英雄马到功成，多少亡魂哀怨嗟叹？\r\n\r\n功高震主的人，杀身之祸总是难免。\r\n\r\n而对于“主子”而言，事后文过饰非颠倒黑白，比起杀戮来，更是拿手好戏。\r\n\r\n至于仅存在于少数人心中的真相，随着时间推移，终会飘散无踪……\r\n\r\n许嵩全新创作中国风，跳出当下一切流行套路。梦游旧朝，明写君臣关系暗抒历史观，意旨深远。如果说作品前半段还是他标志性的慵懒与忧伤，后半段则令人拍案惊喜：多把失真吉他的层叠渐进，将格局骤然扩张；撕裂式的高音演唱，彻底抛开声乐传统；第四分钟之后甚至飚出男高音真声罕有企及的超高音“Hi C#”，将悲悯情绪发泄到极致。MV导演陈映之为让画面体现歌曲深沉质感与磅礴大气，大手笔启用直升机航拍，壮阔大海、层峦崖石、平沙落日、幽秘森林，一一全景式呈现。\r\n\r\n05. 闺蜜\r\n\r\n「 闺蜜一出手 / 真让你难受 / 现实教会了人要往前游 / 却弄丢朋友 」\r\n\r\n“闺中密友”不是应当简作闺密吗？为何新新人类惯用“闺蜜”？\r\n\r\n可能换了个“蜜”字，就像是能增加几分同甘共苦的甜蜜感吧。\r\n\r\n可许嵩笔下的这对闺蜜，有不同的故事。小小说般层层推进情节，用词精炼老道；结尾话锋一转，升级立意。配乐怀旧却又带着鲜明的节奏律动，这是专属于他的音乐特质。\r\n\r\n他写闺蜜关系，君臣关系，师生关系，……他度量着人与人之间的温度，用他温暖的腔调捂热现实的冰冷。\r\n\r\n06. 装糊涂\r\n\r\n「 对于你的谎话我装糊涂 / 装糊涂是极难的艺术 / 稀里糊涂是我的包容 」\r\n\r\n在爱情里，一切的质疑都是不必要的。因为，如果不能接受，干脆趁早分开；如果不想分开，那就装糊涂吧，不然就算鱼死网破得到了真相，又能有什么更好的结果？\r\n\r\n——但要小心，某一个清晨醒来也许会发现，自以为的温存竟是梦游般的幻觉，现实中早已一无所有！\r\n\r\n装糊涂，装到真的糊涂了……\r\n\r\n许式经典R&B，逐层递进的配唱方式，摇摆感性的节奏律动，把这首歌曲推送到每个“糊涂着却不糊涂”的人心中。2012暑期档影片《影子富豪》制片方在第一次听到歌曲小样时，就立马邀此歌作为电影主题曲。\r\n\r\n07. Play with style\r\n\r\n何谓Play with style？抛开潮流的诱惑，突破名相的束缚，活出真自我，找到自己的态度是为先！此作品除了歌词层面传达了这一意旨，音乐方面也极具先锋性：世界民族乐器的大量融入，给音乐增添了一份神秘的色彩——但却又辅以西洋感的R&B鼓点、极前卫的弹性演唱方式——这种古今碰撞所产生的特殊质感，恐怕只有许嵩能独家定制。\r\n\r\n08. 心疼你的过去\r\n\r\n「 忽然你哭了 / 问你在哭什么 / 你哭的更狠了 / 我好像明白了 」\r\n\r\n每个人都有过去，但不是每一段过去都能轻易过得去。\r\n\r\n你若爱Ta，你便很可能纠结于Ta的过去；Ta若爱你，便很可能对你隐瞒Ta的过去。\r\n\r\n如果时间是一条河……你是否愿意在梦里游回到岁月上游，去更早的时间点和Ta相遇，为Ta拦下所有的伤害？\r\n\r\n许嵩此作采用日记体写作风格，整篇没有任何诗意斧凿，用最真实的笔触把最纠结的心疼刻画到血肉里，令人惊心。循环渐进式的R&B Loop编曲与深情款款的念唱，逐层铺排出幽诡阴郁的氛围。从《伴虎》的激越磅礴，到《对话老师》的顽皮十足，再到《幻听》的传统深情，直到这一首的Rap……许嵩作为创作人以及演唱者，在《梦游计》这张专辑中展现了对多种曲风的极佳驾驭力，使得此专辑一经推出无论在广度还是深度上都备受瞩目。\r\n\r\n09. 全球变冷\r\n\r\n这是一个全球化的时代，这是一个地球村。但不知道从什么时候开始，繁盛的背后培育起冷漠，GDP的上扬伴随着道德的滑坡，丰富的物质世界背后是精神世界的逐渐荒芜……我们是该坐视人与人之间冰山横陈、任凭全球变冷，还是用微笑温暖彼此？许嵩此作写于“小悦悦”事件之时，不为问责，只愿同样的悲剧能少一些，人与人之间的关怀能多一些。\r\n\r\n10. 亲情式的爱情\r\n\r\n「 我有多想多想再看一眼 / 你最后那天在我身边 / 那熟悉的脸 ……」\r\n\r\n是否电光石火般的爱恋，最终都会归于平淡？当曾经的日思夜想辗转反侧魂不守舍，沦为一起吃饭睡觉买菜吵架做家务，恐怕就再也没有给对方写一封情书的雅兴了……\r\n\r\n但，爱是消失了，还是悄悄转化了存在形式？\r\n\r\n许嵩这首作品的创作，是感于新闻里一件真人真事。一对中年夫妻遭遇了一场严重车祸，丈夫卡在车轮下难以救出，他停止心跳前对救援人员的最后一句话是，别管我，先救我爱人！说完便再也没有睁开眼睛。侥幸生还的妻子在事后哭着接受采访说，就在车祸发生前一分钟，他们还在为家庭琐事吵嘴，吵得很凶，而前一阵还在闹离婚。……\r\n\r\n珍惜身边人，让爱从日常生活里流淌出来，不要等到失去才追悔，一辈子并没有想象之中那么长。', 'music/2/17/17.jpg', '1');
INSERT INTO `album` VALUES ('18', '2', '江湖', '2016-08-31 17:16:28', '太合音乐', '何谓江湖？\r\n\r\n在众人眼中，大概是刀光剑影，大概是恩怨情仇。\r\n\r\n许嵩的《江湖》又是怎样？\r\n\r\n \r\n\r\n伴随着淅沥小雨、悠远笛声和忽然惊醒梦中人的一记古筝，听者跟随主人公潜入暗夜——飞檐上，雨滴滑落连接天地；暖阁中，美人抱琴半遮面。“今夕是何夕”？“故地是何地”？两句不知是嗟叹还是反问的唱词，便廓清了他与一切剑拔弩张的关系，曾经的江湖落拓，曾经的鲜衣热血，都已风干飘零，即便“飞鸽来急”，也要兀自“沉默江湖里”。\r\n\r\n \r\n\r\n音乐演绎方面，经典的传统民乐与全新电子乐器绝妙融合，复古情怀与时代感兼得。两段间奏里中国大鼓与HIPHOP电鼓的交织并进令人拍案，更大胆使用唢呐、锣等等极难在流行乐中运用的中国元素，构建出一派刀光剑影、名利杀场的浮华江湖，以此与主角的出离隐遁形成了反差，令人印象深刻。与许嵩以往一些较为“柔情”的中国风作品相比，《江湖》更偏于描摹“侠骨”，用词极简，旨意却更为深远。“敬属江上雨/寒舟里/我独饮”——作品以一句“我独饮”作结，人声从恢弘的伴奏中抽离出来，一如主角从纷乱的江湖中抽身一般，告别前尘往事，悠然归隐。\r\n\r\n \r\n\r\n这首歌作为网剧《画江湖之不良人》的主题曲，与剧目的内容也极为贴合。《画江湖之不良人》中的主角李星云就是一个“衣锦夜行”之人，便如许嵩在歌中营造出的江湖一般，恩怨散去、刀剑归隐。后期制作方面，编曲由著名音乐人郑楠操刀，层次细腻丰富，功力毕现；总制作人、混音师、录音师、母带工程师一如既往的全部由许嵩本人亲自担任，全情投入到每一个音乐细节里，精益求精，确保了作品的一流水准。', 'music/2/18/18.jpg', '1');
INSERT INTO `album` VALUES ('19', '2', '深夜书店', '2017-03-14 17:16:28', '海蝶', '深夜街角书店\r\n\r\n散落着摇摇的灯火\r\n\r\n穿越纸张一面\r\n\r\n是你半边清秀侧脸\r\n\r\n时间滴答淌过\r\n\r\n想说什么该怎么说\r\n\r\n \r\n\r\n创作才子许嵩 x 虚拟歌姬洛天依\r\n\r\n白色情人节惊喜相遇\r\n\r\n跨越次元献音乐重磅\r\n\r\n最好的偶然\r\n\r\n是与你不期而遇\r\n\r\n \r\n\r\n许嵩操刀创作倾心Jazz-Hiphop\r\n\r\n洛天依破壁次元浪漫对唱\r\n\r\n治愈系声线里装满甜蜜的词不达意\r\n\r\n演绎冬末春初闪烁烂漫的怦然心动\r\n\r\n不经意的回眸是我刻意安排的邂逅\r\n\r\n深夜书店里 有你 你是美好地', 'music/2/19/19.jpg', '1');
INSERT INTO `album` VALUES ('20', '2', '温泉', '2020-05-20 17:16:28', '海蝶音乐', '骑车漫游泉水小镇\r\n\r\n夏日旅途 情意升温\r\n\r\n爱如温泉般 彼此疗愈\r\n\r\n许嵩最新作品《温泉》于2020年5月20日发行，由许嵩作词作曲及制作。以《温泉》为题，书写爱的疗愈与温柔的力量。旋律线如同林间小路般蜿蜒游走，直到抵达丛林深处那一池藏在心底的寂静温泉。歌曲蕴含的情味是丰富的：一方面是美好欢愉的当下时刻，另一方面笑容背后的往事不必触及，未来亦包含着不确定性。暖调与冷调交织的微妙情绪，既贡献出全新的许式温情甜话，也道出温泉之底的潜流心语。\r\n\r\n演唱方面，女声部分由新锐歌手刘美麟献声演绎，许嵩亲自坐镇为其录音并一手操办歌曲制作，为乐迷奉上了不可多得的男女对唱新作。', 'music/2/20/20.jpg', '1');
INSERT INTO `album` VALUES ('21', '2', '素颜', '2010-08-18 17:16:28', '唯亿文化传播', '这首是与何曼婷一起合作的新单曲，新节奏，R&B曲风，依然还是VV的风格。。。轻快。。', 'music/2/21/21.png', '1');
INSERT INTO `album` VALUES ('22', '2', '绝代风华', '2018-11-22 17:16:28', '华宇世博', '《绝代风华》单曲介绍 2018继发行第七张个人全创作专辑《寻宝游戏》后，许嵩受邀为游戏《天下3》创作出全新主题曲《绝代风华》，暌违数年的“许氏中国风”再现江湖。 \r\n\r\n《绝代风华》的基调是逍遥自在的：主人公曾“鲜衣怒马”、“征战杀伐”，有了所爱之人后便告别江湖、悠然归隐，与知己落棋听雨、朝夕为伴、互赏风华。特别之处是开篇以悬疑气氛入题，描摹不速之客在林间暗伏之景——许嵩用寥寥数语就为笔下人物创造出一种“隐逸中带有少许凶险”的生活状态，让人物鲜活起来。生动的叙事性、严谨的逻辑性、造词与用典的准确性，这三者是许嵩国风类词作的一贯特性。\r\n\r\n 音乐方面，许嵩的国风音乐一贯强调律动与节奏，以电鼓与民族大鼓相交叠的方式，让听感自由穿梭于中西之间，毫不拘谨；古筝琵琶笛子与失真吉他熔于一炉，古今交错，擦除时代感。主副歌的旋律创作采用由快到慢、由短句到长句的对比手法，呼应词里由愉悦喝茶下棋到深情回忆往事的情绪变化，丝丝入扣。词、曲、唱、制作紧密咬合，达到浑然一体的程度。', 'music/2/22/22.jpg', '1');
INSERT INTO `album` VALUES ('23', '2', '羡慕', '2020-01-02 17:16:28', '华宇世博', '许嵩2020最新单曲作品《羡慕》正式发行，由许嵩词曲创作及制作。新年新单曲以一则夏日故事给寒冬带来暖意。\r\n\r\n“我走进电影院看一部冷门的戏” ，曲中人去影院看冷门戏，顺带看到观众火热戏，激起一串内心戏，不知有无反转戏。时间从入场前到散场后，场景由户外到室内再到户外，影院里的“冷”气引发“暖”心举动继而形成连锁反应，许嵩以精巧的布局谋篇和生活化的诗歌笔触来书写一桩观影小事，书写心中的情爱冷暖。而那些多义的词句更是赋予了这首作品极大的想象弹性，构成了《羡慕》独特的艺术效果。\r\n\r\n作曲与编曲中分寸适宜地融入了蓝调音乐风格，将词中淡淡的浪漫、暗暗的幽默与生活的闲情精准地呈现出来。独具一格的悠然旋律不急于抢夺人耳，却以丰富而耐听的细节攻占人心。洒脱随性的演唱为这首作品注入了鲜活而灵动的生命力。音乐制作精致简洁，令人能够静下心来反复聆听回味。\r\n\r\n是羡慕的还是被羡慕的，是旁观者还是亲历者，是纪实还是虚构，是赞美还是揶揄，是触摸到了情爱的真相还是坐井观天，这些设问和歌中男女的故事走向一起，让《羡慕》成为了一道海市蜃楼般亦真亦幻的风景。', 'music/2/23/23.jpg', '1');
INSERT INTO `album` VALUES ('24', '2', '自定义', '2009-01-10 17:16:28', '华宇世博', 'Vae（许嵩）首张独立创制专辑《自定义》，1月10日正式发行。近年来在网络上凭借多首原创作品及独特个人气质一直人气高涨的Vae，包揽了《自定义》的作词、作曲、编曲、演奏、制作乃至录音、混音等一切工作。12月11-21日，在其官方网站十日预售量即突破一万张，可谓树立了独立音乐人的人气典范。 \r\n\r\n22岁的Vae，在他的《自定义》里彻头彻尾的实现了自己主宰音乐，定义自我。有如此独当一面的能力的华语歌手本就不多，其中用四个月就能从无到有的交出这样一张优秀唱片的人更少，而交出之后有这么多人趋之若鹜的热议和支持而不是孤芳自赏——并且，这一切都是在没有经纪公司宣传推广的前提下，实在可以说是稀奇了。 \r\n\r\n我们也向你诚意推荐这张风格独特、听感舒适的《自定义》。 \r\n\r\n独立营造每一个音乐细节，使得整张专辑充满了浓郁的个人气息。Vae冷色调的感情逻辑贯穿始终，复古和流行碰撞的旋律线条随处可见，全方位的音乐能力展露锋芒。《内线》、《多余的解释》、《如果当时》、《坏孩子》、《城府》等曲目，有强烈的叙事感与自嘲意味，加上若隐若现的黑色幽默，和当下热门大碟里或甜腻或悲痛或忧伤或劲爆的音乐都不同的是，《自定义》里每首作品都好比一出悲喜剧——难以对其定义，难以给其归类，但又有血有肉，惹人玩味。这样既让人有听头、又让人有想头，既有流行潜力、又保持了创作个性的华语歌曲确实为数不多。 \r\n\r\n《自定义》的感情色彩是灰色的，暗涌的回忆与潜藏的自我调侃交替更迭，在情绪处理上有着超越年龄的成熟和细腻。创作者Vae也似乎压根没有打算让整张专辑的曲风变化多端，摆成一道拼盘——如果几年后《自定义》还被很多人提起，那么这一点一定是个重要因素——风格上的协调性被驾驭的极为出色，但又绝对让人一遍听下来就记得住每首歌的特质。歌词题材方面，亦在小范围内做了大文章，回归情歌本质，以内心体验和情感故事为主，不过也有如《内线》这样涉及杀手暗战的边缘题材让人耳目一新。音乐制作方面，Vae简洁而soft的音乐编配安静舒适，个人辨识度与耐听度很高。当捧着歌词册聆听与玩味《自定义》一遍之后，相信你能感知到它独特的音乐份量。 \r\n\r\n没有商品化的定位和包装，没有企宣团队的策划和炒作，这张独立唱片也没有像很多初次发片的新人一样为了标榜独特而去大肆玩弄风格流派上的概念。不过，以Vae的网络知名度而言，虽然是初次发片但也算不得新人了。这张自居一格的《自定义》，蕴含着让人欣喜的极大可能。', 'music/2/24/24.jpg', '1');
INSERT INTO `album` VALUES ('25', '2', '苏格拉没有底', '2011-04-01 17:16:28', '海蝶', '『苏格拉底：我知道一件事，那就是我什么都不知道』\r\n\r\n如果你一脸问号，不解许嵩何许人也，证明你已经开始落伍了。\r\n\r\n许嵩，85后原创音乐人，2009年独立出版首张词曲全创作专辑《自定义》，2010年独立出版第二张词曲全创作专辑《寻雾启示》，两度掀起讨论热潮，并均在唱片发行一个月内售罄。\r\n\r\n他的音乐自成一个世界，却总是巧合般地与这个时代连动，吸引着越来越多年轻人的关注。\r\n\r\n他在百度、腾讯等门户歌手排行榜上常年稳居前十位；他的作品在中国移动彩铃榜上是畅销冠军；他的作品随便挑几首都可累计破亿的试听量；他的《灰色头像》、《叹服》等作品是年轻人的流行圣经，以至于在发表一年后仍然雄踞排行榜；他的个人论坛Vaecn.com截至此刻已有41万铁杆会员；他的贴吧、微博等网络阵营常年人气旺盛；他的词曲作品尤以作词视角的把握独步江湖，素有音乐怪才之称。\r\n\r\n当你给男/女朋友打电话听到对方的彩铃时，当你打开电视听到入耳的广告歌时，当你打开电脑随机播放热门歌曲列表时……你在生活里，早已与他悄然相遇过了。\r\n\r\n思考者的梦\r\n\r\n『苏格拉底：未经思考的生活是不值得过的』\r\n\r\n从昔日那个写着哼着《城府》夺得各大音乐试听榜冠军的音乐顽童成长到今时，许嵩在音乐层面一直保持独立做派，此番再度包揽十首词曲的全部创作。毫无粉饰的生存哲学，超越现实的想象思辨，细而不腻的私人回忆，在十首作品里尽数展现。自成一派的制作风格与词曲质感，随性慵懒的演绎方式，标志性的假音与转音，舒服惬意的中慢板R&B节奏……令人一听便可品出强烈的个人风味。浪漫与幽默并存、务实与务虚交织，《苏格拉没有底》仿若暗器般无色无味却能迅速在人心中稳固沉积，在悠然自得的节奏摆荡中持续扩散。', 'music/2/25/25.jpg', '1');
INSERT INTO `album` VALUES ('26', '2', '蝴蝶的时间', '2017-11-30 17:16:28', '海蝶', '梁祝化蝶，是千百年来为人们传颂的爱情绝唱，可谓家喻户晓。无论是诗词、戏曲、音乐、电影，都不止一次地演绎着这段故事。此次许嵩受邀为连续剧《梁山伯与祝英台新传》创作的主题曲，不同于之前梁祝题材的音乐作品，独辟蹊径地化身蝴蝶，以蝴蝶的视角来回首那段经典传说。\r\n\r\n \r\n\r\n作为创作人与音乐制作人，许嵩对每一首原创作品的打磨都力求既坚持个人风格又推陈出新，于细节处见功夫。钢琴前奏刚响起便连续多次转调，带来新鲜听感的同时营造出游走与不确定的氛围，如同窥见那坠入时空黑洞的蝴蝶。大量电子乐器与电子鼓的穿梭使用，打破所谓“复古”与“流行”的界限，和他笔下的歌词一样，在古今语汇里自由穿行，擦除年代印记与风格标签。如“等到月影斑驳/等到满城花落”呼应开篇“花开不败/香满楼台”，以超现实的意象来表现时间的诡谲流速；副歌一句“百年后”，进而“千年后”，倏地拉伸了故事的时空维度；钢琴演奏或柔曼如雾、或铿锵如铁，与琵琶的缠绵悱恻交替前行，让这首歌在角徵宫商之外多了一份跨越时空的厚重质感——不以世人的时间为尺度，而以蝴蝶的时间为线索。\r\n\r\n \r\n\r\n许嵩向来秉持玩音乐、享受音乐的心态，辅之以严谨的工作态度，打造了一首首极具个人风格的全新作品。目前，第七张全创作专辑也正式进入制作期。', 'music/2/26/26.jpg', '1');
INSERT INTO `album` VALUES ('27', '2', '违章动物', '2013-08-22 17:16:28', '海蝶', '沉静外表下 一束炽热而犀利的目光\r\n\r\n许嵩2013年度单曲——《违章动物》\r\n\r\n作词+作曲+制作+编曲+录音+混音+唱=许嵩，一个人的音乐世界\r\n\r\n2013对于许嵩来说是沉淀的一年。在做完了年初的不插电演唱会之后，许嵩请辞了几乎所有的演艺工作，转而投身旅行，阅读，音乐进修，创作，出版个人摄影随笔集《海上灵光》……许嵩说，短暂的抽身并不是贪图安逸，而是得以用客观清醒的视角，重新梳理忙忙碌碌的日常工作，重新审视自己的音乐，进而找寻出更本我的音乐表达方式。\r\n\r\n最新单曲《违章动物》的音乐风格充满许嵩的个人特质。平稳有力的鼓点律动，清冷而迷离的乐器音色编配，慵懒随性不带斧凿的唱腔，不动声色的铺陈出一个关于“违章动物”的故事。他在编曲中引入世界音乐的元素，如开篇与结尾的原生态唱段采样以及少数民族原声乐器，这些民族元素与西洋鼓点Loop冲撞出一种时空错位的奇异氛围，而与之呼应的是，歌词里古今穿梭的遣词造句，亦是在时空错位中完成的一轮许嵩式的抒发。连说带唱的演绎方式，戏谑劲儿拿捏的恰到好处：多一分则偏向玩世不恭，少一分则流于严肃刻板。\r\n\r\n《违章动物》的意旨，听者与作者或许心照不宣，又或许各有解读。他在作品里一直体现这样的态度：做言之有物、有血有肉的音乐。社会生活里的大小事件，随时都可能成为他音乐创作的题材。然而在具体的创作手法上，许嵩又绝不局限于就事论事、一味地去表达同情或批判，而是探索着更多的表达可能性：他把对于社会生活的关注以一种设身处地的视角来陈述，以一种诗化的语言来发想，从而避免了悲天悯人式的说教感或愤青发泄式的苍白感，体现出了艺术的魅力。\r\n\r\n某种程度来说，许嵩又何尝不是一个不折不扣的“违章动物”：在他的音乐里，他从来不是按章法出牌、循着通常流行路数行走的音乐人。这首《违章动物》，也可视作他为各路“不合规则”的违章动物们做了一场真情代言。', 'music/2/27/27.jpg', '1');
INSERT INTO `album` VALUES ('28', '2', '送你的独白', '2007-12-04 17:16:28', '', '', 'music/2/28/28.png', '1');
INSERT INTO `album` VALUES ('29', '2', '通关', '2017-06-30 17:16:28', '海蝶', '打一场比赛，我们过关斩将，力求通关。\r\n\r\n玩一个游戏，我们全情投入，期待通关。\r\n\r\n谈一回恋爱，分分合合，持久作战，只为修成正果，早日通关。\r\n\r\n过一场人生，经历多少悲欢洗礼，天人交战，最终才能活的明白通透，顺利通关？\r\n\r\n……\r\n\r\n天下事，事事皆是修炼，时时都在通关之路上。我把这些细碎的念头揉捻成了《通关》这首歌。\r\n\r\n——许嵩\r\n\r\n近来许嵩忙于“青年晚报”演唱会的巡回演出，然而新专辑与新单曲的创作与打磨也在同步进行中，毫无懈怠。此次最新发表单曲《通关》，亦是一首值得反复玩味的音乐作品。曲目以强劲的鼓点律动打开局面，行云流水般的旋律，六把吉他的精彩演绎，加上许嵩随性的唱腔，“通关”的畅快之感展露无遗。歌词里考究的细节不胜枚举，例如：“我感谢自己平凡，敢爱敢恨没负担”；“我感谢自己不凡，可爱可恨都包揽”。相同的句式，仅换几个字，就将两种截然不同的人生轨迹勾勒出来，对比鲜明却又共存在一体之下，文趣丛生。\r\n\r\n《通关》由许嵩包揽作词作曲及制作，郑楠编曲，特别值得一提的是歌中每把吉他均由新加坡著名音乐家AdamLee先生弹奏，做出了教科书级别的精彩演绎。', 'music/2/29/29.jpg', '1');
INSERT INTO `album` VALUES ('30', '2', '雨幕（新天龙八部）', '2019-10-13 17:16:28', '海蝶音乐', '许嵩2019最新单曲《雨幕》，由许嵩包揽作词、作曲、制作及演唱。\r\n\r\n时隔一年未见新作，此次“飘然一曲”诱得广大乐迷“侧耳听”。潇潇的雨幕里，三日无言的福船上，饮酒、听曲、赏雨、忆人，然而故事却在有人卧于绯泊之中时戛然而止，故事表象下的诸多隐喻也浮出水面。独此一家别无分号的叙事笔法，布局谋篇像本逻辑缜密的小小说，起承转合间充满戏剧张力。文趣盎然的遣词造句，既有新颖的意象与丰富动人的细节，也有言而未尽的留白与隐喻。作为《新天龙八部》的主题曲，全篇只字未描写武打争斗，却在看似绘景的潇潇雨幕里暗藏着汹涌伏笔，为作品平添了悬疑色彩。\r\n\r\n音乐方面，简洁工整、含蓄隽永的旋律赏心悦耳，偶尔的离调所带来的曲折跌宕感配合歌词一起细品更是滋味无穷。强有力的鼓点节奏稀释了感伤的浓度，反而让整体的情绪变得更加微妙而耐听。有别于2018年大受好评的《寻宝游戏》的随性不羁，许嵩此次以沉稳内敛的唱腔来诠释新作。《雨幕》词、曲、制作、唱的一体性达到了紧密咬合无可分割的程度。', 'music/2/30/30.jpg', '1');
INSERT INTO `album` VALUES ('31', '2', '雪花谣', '2007-11-28 17:16:28', '海雷音乐', '', 'music/2/31/31.png', '1');
INSERT INTO `album` VALUES ('32', '2', '青年晚报', '2016-06-27 17:16:28', '海蝶', '◆2016年许嵩最新作品《青年晚报》，许嵩第6张词曲全创作专辑。\r\n\r\n◆《青年晚报》，是一个三十而立的青年敞开自己和你面对面交心，也是一家晚报记述着生活的真相和所引发的思考，感性与理性交叠。歌词读来有如摊开一张晚报所看到的版面：社会生活、人生况味、暖心故事、摄影专栏，甚至不缺关于“最佳歌手”的娱乐头条以及“早睡身体好” 的养生大法。闪耀着思维火花的文字，诗性与易读性兼具，偶尔透出冷冷的幽默感，是独属于许嵩的那份亦庄亦谐。\r\n\r\n◆《青年晚报》以宽阔的创作视野展现了多元化的音乐风格，而这一切又统一于许嵩的个人特质，丰富而不散乱。较多曲目以电钢、电吉他以及流动的电子乐音色为串联，铺陈出静谧氛围，一如唱片封面中行走在巴黎街头的青年，背靠夕阳，晚报时分。\r\n\r\n◆音乐制作方面，《青年晚报》由许嵩担任音乐总监并包办制作所有曲目。至今为止许嵩已经一人作词、作曲、唱、制作6张个人专辑，“一人包办制”使得他的专辑一贯具有极为强烈的个人风格。编曲及演奏方面，包括AdamLee、蔡廷贵、郑楠、高飞等来自新加坡、北京与台北的著名音乐人友情加盟，为《青年晚报》添彩。\r\n\r\n◆唱片的平面资料及《摄影艺术》的音乐录影带拍摄于法国巴黎。十余人团队同许嵩一起从北京出发，海外拍摄共花费长达半个月，由青年摄影家张罗平掌镜，真正实践“摄影艺术”。《雅俗共赏》及《最佳歌手》的音乐录影带由台湾金曲奖最佳导演比尔贾执导，用前卫的影像风格精准呈现歌曲内涵。\r\n\r\n◆2016是许嵩进入公众视野的第十年，十年内成功发行6张词曲全创作专辑以及近40首原创单曲，专注创作从未停歇前行的脚步；屡屡获得国内外各大华语音乐颁奖典礼奖项，每张专辑都拥有突破亿万次的数字音乐下载量，影响力持续发酵；从年少成名到引发争论再到才华终受广泛认可，十年里无论身处什么阶段许嵩始终保持低调姿态，而许嵩的庞大歌迷群体也从当初冲动狂热的少年转变为如今以成熟理性青年为主，可谓是共同成长的青春十年。', 'music/2/32/32.jpg', '1');
INSERT INTO `album` VALUES ('33', '2', '飞驰于你', '2018-09-07 17:16:28', '海蝶', '敦煌作为古代丝绸之路的重要节点，东西方文化在这里汇聚碰撞，更拥有着莫高窟、阳关、月牙泉等古迹名胜，是世界级的文化名城。近日QQ飞车手游推出敦煌主题版本，邀请许嵩创作并演唱全新主题曲《飞驰于你》。\r\n\r\n \r\n\r\n《飞驰于你》由许嵩包揽词曲创作及制作。因敦煌在古时即传入了西域文化，许嵩在作曲中特意融入西域音乐元素，以富有异域风情的曲调展现敦煌的神秘；偶尔点缀的转音又带有甘肃敦煌当地的戏曲特色，契合了敦煌作为多民族文化荟萃之地的特质；民族音乐鼓点与摇滚乐新鲜搭配，以强劲的节奏感展现飞驰于敦煌奇景时的快意。\r\n\r\n \r\n\r\n词作方面，对意象进行精心拣选，寥寥数语即构建出敦煌秘境。在展现飞驰时的速度与激情之外，以“你”指代敦煌，抒发对敦煌厚重历史的感慨，令整首作品轻松潇洒而又不失余味。\r\n\r\n \r\n\r\n近年来许嵩为大量热门游戏创作主题音乐，每一次的创作都实现了既贴合主题气质、又淋漓尽致展现个人风格，并且始终坚持创新、诚意十足，不断给乐迷带来全新的听觉体验。', 'music/2/33/33.jpg', '1');

-- ----------------------------
-- Table structure for album_type
-- ----------------------------
DROP TABLE IF EXISTS `album_type`;
CREATE TABLE `album_type` (
  `type_id` int NOT NULL AUTO_INCREMENT COMMENT '专辑种类id',
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '专辑种类名称',
  PRIMARY KEY (`type_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 COMMENT='Album_type专辑种类实体类';

-- ----------------------------
-- Records of album_type
-- ----------------------------
INSERT INTO `album_type` VALUES ('1', '内地');
INSERT INTO `album_type` VALUES ('2', '港台');
INSERT INTO `album_type` VALUES ('3', '欧美');
INSERT INTO `album_type` VALUES ('4', '日本');
INSERT INTO `album_type` VALUES ('5', '韩国');
INSERT INTO `album_type` VALUES ('6', '其他');

-- ----------------------------
-- Table structure for attention_album
-- ----------------------------
DROP TABLE IF EXISTS `attention_album`;
CREATE TABLE `attention_album` (
  `attention_id` int NOT NULL AUTO_INCREMENT COMMENT '专辑关注id',
  `user_id` int NOT NULL COMMENT '用户id',
  `album_id` int NOT NULL COMMENT '专辑id',
  PRIMARY KEY (`attention_id`),
  UNIQUE KEY `uq_user_album` (`user_id`,`album_id`) USING BTREE,
  KEY `album_id` (`album_id`),
  CONSTRAINT `attention_album_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `attention_album_ibfk_2` FOREIGN KEY (`album_id`) REFERENCES `album` (`album_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8mb3 COMMENT='Attention_Album专辑关注实体类';

-- ----------------------------
-- Records of attention_album
-- ----------------------------
INSERT INTO `attention_album` VALUES ('2', '1003', '1');
INSERT INTO `attention_album` VALUES ('3', '1003', '2');
INSERT INTO `attention_album` VALUES ('1', '1005', '1');

-- ----------------------------
-- Table structure for attention_mv
-- ----------------------------
DROP TABLE IF EXISTS `attention_mv`;
CREATE TABLE `attention_mv` (
  `attention_id` int NOT NULL AUTO_INCREMENT COMMENT 'mv关注id',
  `user_id` int NOT NULL COMMENT '用户id',
  `mv_id` int NOT NULL COMMENT '视频id',
  PRIMARY KEY (`attention_id`),
  UNIQUE KEY `u_m_id` (`user_id`,`mv_id`) USING BTREE,
  KEY `mv_id` (`mv_id`),
  KEY `user_id` (`user_id`) USING BTREE,
  CONSTRAINT `attention_mv_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `attention_mv_ibfk_2` FOREIGN KEY (`mv_id`) REFERENCES `mv` (`mv_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Attention_Singer关注歌手实体类';

-- ----------------------------
-- Records of attention_mv
-- ----------------------------

-- ----------------------------
-- Table structure for attention_singer
-- ----------------------------
DROP TABLE IF EXISTS `attention_singer`;
CREATE TABLE `attention_singer` (
  `attention_id` int NOT NULL AUTO_INCREMENT COMMENT '歌手关注id',
  `user_id` int NOT NULL COMMENT '用户id',
  `singer_id` int NOT NULL COMMENT '歌手id',
  PRIMARY KEY (`attention_id`),
  UNIQUE KEY `u_s_id` (`user_id`,`singer_id`) USING BTREE,
  KEY `singer_id` (`singer_id`),
  KEY `user_id` (`user_id`) USING BTREE,
  CONSTRAINT `attention_singer_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `attention_singer_ibfk_2` FOREIGN KEY (`singer_id`) REFERENCES `singer` (`singer_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=utf8mb3 COMMENT='Attention_Song关注歌手实体信息';

-- ----------------------------
-- Records of attention_singer
-- ----------------------------
INSERT INTO `attention_singer` VALUES ('12', '1005', '2');

-- ----------------------------
-- Table structure for attention_song
-- ----------------------------
DROP TABLE IF EXISTS `attention_song`;
CREATE TABLE `attention_song` (
  `attention_id` int NOT NULL AUTO_INCREMENT COMMENT '歌曲关注id',
  `user_id` int NOT NULL COMMENT '用户id',
  `song_id` int NOT NULL COMMENT '歌曲id',
  PRIMARY KEY (`attention_id`),
  UNIQUE KEY `user_id` (`user_id`,`song_id`) USING BTREE,
  KEY `song_id` (`song_id`),
  CONSTRAINT `attention_song_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `attention_song_ibfk_2` FOREIGN KEY (`song_id`) REFERENCES `song` (`song_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Attention_Song歌曲关注实体信息';

-- ----------------------------
-- Records of attention_song
-- ----------------------------

-- ----------------------------
-- Table structure for comment
-- ----------------------------
DROP TABLE IF EXISTS `comment`;
CREATE TABLE `comment` (
  `comment_id` int NOT NULL AUTO_INCREMENT COMMENT '歌词评论id',
  `id` int NOT NULL COMMENT '用户id',
  `song_id` int NOT NULL COMMENT '歌曲id',
  `content` varchar(512) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '评论内容',
  `content_time` datetime DEFAULT NULL COMMENT '评论时间',
  `number` int DEFAULT '0' COMMENT '点赞数',
  PRIMARY KEY (`comment_id`),
  KEY `id` (`id`),
  KEY `song_id` (`song_id`),
  CONSTRAINT `comment_ibfk_1` FOREIGN KEY (`id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `comment_ibfk_2` FOREIGN KEY (`song_id`) REFERENCES `song` (`song_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Comment歌曲评论实体信息';

-- ----------------------------
-- Records of comment
-- ----------------------------

-- ----------------------------
-- Table structure for favorite
-- ----------------------------
DROP TABLE IF EXISTS `favorite`;
CREATE TABLE `favorite` (
  `coll_id` int NOT NULL AUTO_INCREMENT COMMENT '喜欢id',
  `id` int NOT NULL COMMENT '用户id',
  `song_id` int NOT NULL COMMENT '歌曲id',
  PRIMARY KEY (`coll_id`),
  KEY `id` (`id`),
  KEY `song_id` (`song_id`),
  CONSTRAINT `favorite_ibfk_1` FOREIGN KEY (`id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `favorite_ibfk_2` FOREIGN KEY (`song_id`) REFERENCES `song` (`song_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Favorite歌曲喜爱实体信息';

-- ----------------------------
-- Records of favorite
-- ----------------------------

-- ----------------------------
-- Table structure for like
-- ----------------------------
DROP TABLE IF EXISTS `like`;
CREATE TABLE `like` (
  `like_id` int NOT NULL AUTO_INCREMENT COMMENT '点赞id',
  `work_type` int NOT NULL COMMENT '作品类型',
  `target_id` int NOT NULL COMMENT '目标id',
  `user_id` int NOT NULL COMMENT '用户id',
  PRIMARY KEY (`like_id`),
  KEY `work_type` (`work_type`),
  CONSTRAINT `like_ibfk_1` FOREIGN KEY (`work_type`) REFERENCES `work_type` (`work_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Like点赞信息实体类';

-- ----------------------------
-- Records of like
-- ----------------------------

-- ----------------------------
-- Table structure for mv
-- ----------------------------
DROP TABLE IF EXISTS `mv`;
CREATE TABLE `mv` (
  `mv_id` int NOT NULL AUTO_INCREMENT COMMENT '视频id',
  `mv_title` varchar(255) DEFAULT NULL COMMENT 'mv标题',
  `song_id` int NOT NULL COMMENT '歌曲id',
  `play_volume` int DEFAULT NULL COMMENT '播放量',
  `cover` varchar(255) DEFAULT NULL COMMENT 'mv封面地址',
  `video` varchar(255) DEFAULT NULL COMMENT '视频地址',
  `time` datetime DEFAULT NULL COMMENT 'mv发布时间',
  `type_id` int DEFAULT NULL COMMENT '视频种类id',
  PRIMARY KEY (`mv_id`),
  KEY `song_id` (`song_id`),
  KEY `type_id` (`type_id`),
  CONSTRAINT `mv_ibfk_2` FOREIGN KEY (`song_id`) REFERENCES `song` (`song_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `mv_ibfk_3` FOREIGN KEY (`type_id`) REFERENCES `mv_type` (`type_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Mv视频实体信息';

-- ----------------------------
-- Records of mv
-- ----------------------------

-- ----------------------------
-- Table structure for mv_comment
-- ----------------------------
DROP TABLE IF EXISTS `mv_comment`;
CREATE TABLE `mv_comment` (
  `comment_id` int NOT NULL AUTO_INCREMENT COMMENT 'mv评论id',
  `id` int NOT NULL COMMENT '用户id',
  `mv_id` int NOT NULL COMMENT '视频id',
  `content` varchar(512) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '评论内容',
  `content_time` datetime DEFAULT NULL COMMENT '评论时间',
  `number` int DEFAULT '0' COMMENT '点赞数',
  PRIMARY KEY (`comment_id`),
  KEY `id` (`id`),
  KEY `mv_id` (`mv_id`),
  CONSTRAINT `mv_comment_ibfk_1` FOREIGN KEY (`id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `mv_comment_ibfk_2` FOREIGN KEY (`mv_id`) REFERENCES `mv` (`mv_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Mv_Comment视频评论实体类';

-- ----------------------------
-- Records of mv_comment
-- ----------------------------

-- ----------------------------
-- Table structure for mv_reply
-- ----------------------------
DROP TABLE IF EXISTS `mv_reply`;
CREATE TABLE `mv_reply` (
  `reply_id` int NOT NULL AUTO_INCREMENT COMMENT '视频评论回复id',
  `comment_id` int NOT NULL COMMENT '视频评论id',
  `user_id` int NOT NULL COMMENT '用户id',
  `content` varchar(512) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '评论内容',
  `content_time` datetime DEFAULT NULL COMMENT '评论时间',
  `number` int DEFAULT NULL COMMENT '点赞数',
  PRIMARY KEY (`reply_id`),
  KEY `comment_id` (`comment_id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `mv_reply_ibfk_1` FOREIGN KEY (`comment_id`) REFERENCES `mv_comment` (`comment_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `mv_reply_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Mv_Reply视频回复实体信息';

-- ----------------------------
-- Records of mv_reply
-- ----------------------------

-- ----------------------------
-- Table structure for mv_type
-- ----------------------------
DROP TABLE IF EXISTS `mv_type`;
CREATE TABLE `mv_type` (
  `type_id` int NOT NULL AUTO_INCREMENT COMMENT 'mv种类id',
  `name` varchar(255) DEFAULT NULL COMMENT '种类名称',
  PRIMARY KEY (`type_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 COMMENT='Mv_Type视频种类实体信息';

-- ----------------------------
-- Records of mv_type
-- ----------------------------
INSERT INTO `mv_type` VALUES ('1', '内地');
INSERT INTO `mv_type` VALUES ('2', '港台');
INSERT INTO `mv_type` VALUES ('3', '欧美');
INSERT INTO `mv_type` VALUES ('4', '日本');
INSERT INTO `mv_type` VALUES ('5', '韩国');
INSERT INTO `mv_type` VALUES ('6', '其他');

-- ----------------------------
-- Table structure for reply
-- ----------------------------
DROP TABLE IF EXISTS `reply`;
CREATE TABLE `reply` (
  `reply_id` int NOT NULL AUTO_INCREMENT COMMENT '歌曲评论回复id',
  `comment_id` int NOT NULL COMMENT '评论id',
  `user_id` int NOT NULL COMMENT '用户id',
  `content` varchar(512) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '回复内容',
  `content_time` datetime DEFAULT NULL COMMENT '回复时间',
  `number` int DEFAULT '0' COMMENT '点赞数',
  PRIMARY KEY (`reply_id`),
  KEY `comment_id` (`comment_id`),
  KEY `user_id` (`user_id`),
  CONSTRAINT `reply_ibfk_1` FOREIGN KEY (`comment_id`) REFERENCES `comment` (`comment_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `reply_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Reply歌曲评论实体信息';

-- ----------------------------
-- Records of reply
-- ----------------------------

-- ----------------------------
-- Table structure for singer
-- ----------------------------
DROP TABLE IF EXISTS `singer`;
CREATE TABLE `singer` (
  `singer_id` int NOT NULL AUTO_INCREMENT COMMENT '歌手id',
  `name` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '歌手名字',
  `foreign_name` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '外文名',
  `alias` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '别名',
  `sex` enum('男','女') CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT '男' COMMENT '性别',
  `nationality` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '国籍',
  `birthplace` varchar(50) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '出生地',
  `date_of_birth` datetime DEFAULT NULL COMMENT '生日',
  `occupation` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '职业',
  `representative` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '代表作',
  `achievement` varchar(1500) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '成就',
  `synopsis` varchar(15000) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '简介',
  `head_portrait` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '头像路径',
  `type_id` int NOT NULL COMMENT '歌手种类id',
  `attention` int DEFAULT '0' COMMENT '关注数',
  PRIMARY KEY (`singer_id`),
  KEY `s_id` (`type_id`),
  CONSTRAINT `singer_ibfk_1` FOREIGN KEY (`type_id`) REFERENCES `singer_type` (`type_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=3 DEFAULT CHARSET=utf8mb3 COMMENT='Singe歌手实体信息';

-- ----------------------------
-- Records of singer
-- ----------------------------
INSERT INTO `singer` VALUES ('1', '周杰伦', null, null, null, null, null, null, null, null, null, null, null, '1', null);
INSERT INTO `singer` VALUES ('2', '许嵩', 'Vae', '嵩哥', null, '中国', '安徽合肥', '1986-05-14 17:16:28', '歌手、词曲创作人、音乐制作人', '《自定义》、《寻雾启示》、《苏格拉没有底》、《梦游计》', '2018华人歌曲音乐盛典年度最佳创作男歌手 2018嗨典年度最佳男歌手 第14届中国华鼎奖华语年度最受欢迎原创歌手 第19、20届东方风云榜最佳唱作人 第17届全球华语榜中榜传媒推荐歌手 第7届中国移动无线音乐咪咕汇最佳人气男歌手 2012亚洲时尚盛典年度时尚原创音乐人 2011/2012中国歌曲排行榜年度金曲奖 第15届音乐风云榜年度媒体关注艺人 第6届腾讯星光大典内地年度男歌手 第19、20届东方风云榜十大金曲奖 第23届东方风云榜最佳作曲奖', '许嵩（Vae），1986年5月14日生于安徽省合肥市，中国内地创作型男歌手，毕业于安徽医科大学。\r\n\r\n2009年1月，许嵩发行首张词曲全创作专辑《自定义》；2010年1月，发行第二张词曲全创作专辑《寻雾启示》；2011年4月，发行第三张词曲全创作专辑《苏格拉没有底》；2012年7月，发行第四张词曲全创作专辑《梦游计》；2014年8月，发行第五张词曲全创作专辑《不如吃茶去》；2016年6月，发行第六张词曲全创作专辑《青年晚报》；2018年7月，发行第七张词曲全创作专辑《寻宝游戏》。\r\n\r\n2006年起许嵩开始发表音乐作品，从而正式出道 。至2020年已成功发行七张个人原创专辑以及近四十首原创单曲，所有歌曲由许嵩创作词曲及音乐制作。截至2020年，许嵩已获得中歌榜、中国华鼎奖、东方风云榜、音乐风云榜等权威音乐榜单颁发的“最佳创作歌手奖”、“最佳唱作人奖”等个人奖项共19次；应邀为游戏、影视剧等创作主题曲包括《雨幕》（新天龙八部端游主题曲）、《千古》（电视剧《花千骨》片头曲）等歌曲共15首；五登央视舞台，七上卫视晚会献唱。\r\n\r\n从艺历程：2006年12月 受联想集团邀请，参加联想“粉时尚”手机发布会，并创作“粉时尚”手机主题音乐《粉色信笺》。\r\n\r\n2007年5月 加入安徽省音乐家协会。\r\n\r\n2008年5月 荣获安徽省十佳青年学生称号，同年7月为搜狐公司的网游《剑仙》制作并演唱主题曲《南山忆》。\r\n\r\n2009年1月10日 出版发行首张个人专辑《自定义》，独立包办词、曲、编曲、唱、录音、制作等一切音乐工作。\r\n\r\n2010年1月6日 第二张独立创作专辑《寻雾启示》出版发行；4月 应搜狐之邀约，创作并演唱《半城烟沙》作为搜狐公司旗下网游《天龙八部2》的主题曲；6月 为联想集团旗下新产品\"乐Phone\"制作并演唱15秒广告音乐，于世界杯开幕战前央视5套首播；8月 应华谊音乐公司邀请，为其旗下新人何曼婷量身打造对唱歌曲《素颜》；10月 为好友金莎创作《你的嘴》、《相思垢》，收录于金莎《星月神话》专辑。\r\n\r\n2011年3月 加入知名跨国唱片公司——海蝶音乐；4月1日 发行第三张创作专辑《苏格拉没有底》；5月-6月 举办唱片巡回签售会（4月30日 安徽合肥，5月3日 天津，5月22日 江苏南京，5月24日 福建福州，6月5日 湖北武汉，6月10日 浙江杭州，6月11日 浙江宁波，6月12日 辽宁，6月18日 广州，6月19日 广东深圳、佛山，6月23日 成都，6月26日 北京）；9月 代言搜狐公司大型网游《天龙八部3》，创作并演唱主题曲《天龙八部之宿敌》；10月25日 于北京举办首场个人演唱会。11月26日 乌鲁木齐演唱会；12月31日 出席江苏卫视跨年晚会表演嘉宾。\r\n\r\n2012年春节 央视网络春晚表演嘉宾；4月30日 南京个人演唱会；6月 与方文山首度联手，为AngelGirl组合创作单曲《花木兰》（作曲）；7月11日 第四张作品《梦游计》全国发行（包括台湾地区），海蝶音乐于7月22日 为许嵩举办新专辑庆功会，宣布发片头十日销量为12万张；7月 与著名运动品牌KAPPA合作，发布主题推广曲《Playwithstyle》；与贝尔塔耳机合作，为该品牌代言人；11月25日 于北京举办个人演唱会；12月29日 于台湾小巨蛋体育馆献唱中国歌曲排行榜年度金曲《幻听》；12月31日 作为央视《起航2013·元旦晚会》表演嘉宾献唱《断桥残雪》。\r\n\r\n2013年1月6日 担任由上海市政府、上海市教委主办的“上海大学生原创音乐大赛”形象大使，并出席决赛直播现场；1月19日 于湖南长沙举办不插电演唱会；3月30日 东方风云榜于上海颁奖，许嵩蝉联两届最佳唱作人奖；4月 上旬受希腊国家旅游局邀请，赴希腊采风摄影；4月20日 在澳门夺得全球华语榜中榜-传媒推荐歌手大奖；8月 摄影随笔集《海上灵光》推出，全国举办多场签售会 ；与西班牙ChupaChups（珍宝珠棒棒糖）合作，创作演唱主题曲《小烦恼没什么大不了》；与步步高Vivo手机、金立手机合作推广新款手机；10月19日 于武汉举办个人演唱会；12月8日 出席中国移动-无线音乐盛典，获得最佳人气男歌手大奖。\r\n\r\n2014年1-6月 第五张专辑制作工作；2014年7月 代言金山公司网游《反恐行动》；2014年8月26日 新专辑《不如吃茶去》北京发布会，海蝶高层正式宣布许嵩出任海蝶集团音乐总监 艺人好友齐齐发来VCR祝福；2014年10月 开始全国签售活动。据《新京报》10月14日 专题报道，《不如吃茶去》截至发稿时互联网累计收听量高达3.8亿次。2014年9月《弹指一挥间》MV发布。\r\n\r\n2015年1月 许嵩荣获华语年度最受欢迎原创歌手大奖。2015年1月8日于上海获得中国华鼎奖-华语年度最受欢迎原创歌手奖。为张靓颖、张杰创作中国风单曲《燕归巢》于除夕发行。2015年3月25日于深圳获得QQ音乐年度盛典-年度创意专辑奖。同年4月11日于北京获得第3届音悦V榜年度盛典-年度创作歌手大奖。4月13日于深圳获得第15届音乐风云榜-年度媒体关注内地歌手大奖。4月23日，于北京酷音乐亚洲盛典获得年度最佳原创歌手奖。8月11日出席由歌手解晓东发起的理想音乐节发布会。 为电视剧《花千骨》创作片头曲《千古》并于8月20日发行。2015年9月14日出席中国大学音乐超级联赛，与词作家林夕老师、四川音乐学院教授王铮亮老师共同担任评委及出任明星导师。12月5日，参加了第九届音乐盛典咪咕汇。 12月6日理想音乐节-深圳站演出。\r\n\r\n2016年2月5日应邀参加安徽卫视春节联欢晚会，独唱原创作品《庐州月》及《燕归巢》。同年2月22日(正月十五），CCTV猴年元宵晚会上，许嵩与小品演员孙涛搭档，共同演唱许嵩原创作品《书香年华》，是许嵩集词、曲、唱、编曲于一人的原创节目。 3月3日由创作才子献唱的电影《不速之客》主题曲《不语》正式发布，这部由黎明、耿乐、韩彩英等演员演绎的犯罪悬疑电影将于3月18日登陆全国院线，上演了一场双雄对决、相爱相杀的精彩故事。 3月5日CCTV全球中文音乐榜上榜开播盛典邀请许嵩献唱《书香年华》。3月28日获得第23届东方风云榜最佳作曲奖。3月31日CCTV《回声嘹亮》压轴表演嘉宾。 4月27日，许嵩《雅俗共赏》首播；6月30日，专辑《青年晚报》正式发行，整张专辑是许嵩对生活的记录，写的是许嵩内心的思考和观察，整张专辑创作的灵感来源于生活；8月31日，发行网剧《画江湖之不良人》主题曲《江湖》，这是为该剧量身打造的歌曲，这也是他首次献声网络剧主题曲；9月27日，许嵩受邀出席“亚洲新歌榜”颁奖典礼，并获“年度最佳唱作人”奖项；11月19日，宣布演唱网剧《梁山伯与祝英台》片尾曲。12月20日，发布网游《神武2》游戏主题曲《今年勇》，完整版于12月22日上线。\r\n\r\n2017年3月14日，与虚拟歌手洛天依合作发行单曲《深夜书店》；18日，“青年晚报”巡演演唱会首站在上海大舞台上演。3月27日，出席第24届东方风云榜音乐盛典，并连获“最佳唱作人”、“十大金曲”两大奖项。4月9日，出席第17届音乐风云榜年度盛典，获得“最受关注原创歌手”大奖。6月24日，许嵩作为“快乐使者”助阵浙江卫视励志梦想真人秀《天生是优我》，演唱《今年勇》献综艺首秀。6月30日，发布网游《QQ三国》十周年主题曲《通关》，单曲延续了许嵩一直以来细腻的中国风；7月15日，“青年晚报”巡演演唱会北京站在首都体育馆上演；8月5日，“青年晚报”巡演演唱会南京站在五台山体育馆成功举办；9月23日，许嵩应邀参加中央电视台网络正能量《点赞中国》晚会录制，献唱《平行宇宙》为现场观众带来了独特的音乐享受 ；9月26日，应邀参加安徽卫视上星二十周年庆典晚会，献唱代表作《素颜》；10月，担任唱吧月度品牌推荐大使、唱吧十月音乐星荐官；10月7日，“青年晚报”巡演演唱会最后一站广州站在广州体育馆举行，“青年晚报”系列巡演圆满收官。11月30日，为网剧《梁山伯与祝英台》演唱的主题曲《蝴蝶的时间》发布。\r\n\r\n2018年1月13日，许嵩出席“2018嗨典”，并获得年度最佳男歌手大奖 。3月24日，许嵩作曲、张杰演唱的歌曲《少年中国说》在CCTV诗词传诵节目《经典咏流传》播出，诠释当代青春正能量 。4月19日，许嵩为《QQ炫舞》创作的音乐旅行系列主题曲《我乐意》首发，洋溢着恋爱清甜、又回归至简，为即将推出的第七张专辑预热；5月14日，许嵩单曲《老古董》正式发布，MV同步上线。6月1日，《大千世界》发布。7月12日，许嵩第七张词曲全创作专辑《寻宝游戏》完整数位版正式全网发布；6月21日，发布《明智之举》；9月27日，演唱QQ飞车手游敦煌版本主题曲《飞驰于你》；11月22日，许嵩为游戏《天下3》十周年创作并演唱主题曲《绝代风华》。\r\n\r\n2019年3月24日，许嵩受邀担任2019排超全明星赛表演嘉宾，一连献唱四首曲目；6月1日，许嵩“寻宝游戏”巡回演唱会于成都五粮液成都金融城演艺中心开演；6月8日，许嵩“寻宝游戏”全国巡回演唱会武汉站于光谷国际网球中心上演；6月22日，许嵩“寻宝游戏”全国巡回演唱会上海站于梅赛德斯奔驰文化中心开演；7月6日，许嵩“寻宝游戏”全国巡回演唱会北京站于凯迪拉克中心上演；7月20日，许嵩“寻宝游戏”全国巡回演唱会最终站在其家乡合肥的合肥体育中心体育馆上演；9月，许嵩应邀参加长江之恋——长江流域十二省市国庆主题晚会录制，登台献唱一曲《山水之间》；10月13日，发布新天龙八部端游主题曲《雨幕》，该单曲由许嵩包揽作词、作曲、制作及演唱；12月，许嵩应邀参加四川卫视“花开天下·国韵”新年演唱会的录制，独唱《我乐意》、《绝代风华》以及《雅俗共赏》；12月，许嵩应邀参加2020BTV环球跨年冰雪盛典的录制，登台献唱经典曲目《有何不可》等。\r\n\r\n2020年1月2日，发行单曲《羡慕》；2020年2月11日，许嵩作曲抗疫情公益歌曲《心暖心等于世界》正式发布，MV同步全网播出；4月6日，发布电视剧《全世界最好的你》同名主题曲《全世界最好的你》。\r\n\r\n荣誉记录：音乐类\r\n\r\n▪ 2018-08-29 2018华人歌曲音乐盛典年度最佳创作男歌手 （获奖）\r\n\r\n▪ 2018-01-13 2018 2018唱吧嗨典年度最佳男歌手 （获奖）\r\n\r\n▪ 2017-04-09 第17届 音乐风云榜年度最受关注原创歌手 （获奖）\r\n\r\n▪ 2017-03-27 第24届 东方风云榜最佳唱作人 （获奖）\r\n\r\n▪ 2017-03-27 第24届 东方风云榜年度十大金曲 雅俗共赏 （获奖）\r\n\r\n▪ 2016-09-27 2016 亚洲新歌榜年度最佳唱作人 （获奖）\r\n\r\n▪ 2016-03-28 第23届 东方风云榜最佳作曲奖 燕归巢 （获奖）\r\n\r\n▪ 2015-12-06 第9届 中国移动咪咕汇十大畅销金曲 山水之间 （获奖）\r\n\r\n▪ 2015-04-23 2015 酷音乐亚洲盛典年度最佳原创歌手 （获奖）\r\n\r\n▪ 2015-04-13 第15届 音乐风云榜年度媒体关注内地歌手 （获奖）\r\n\r\n▪ 2015-04-11 第3届 音悦V榜年度创作歌手年度盛典 （获奖）\r\n\r\n▪ 2015-03-25 第2届 QQ音乐年度盛典年度创意专辑 不如吃茶去 （获奖）\r\n\r\n▪ 2015-01-08 第14届 中国华鼎奖华语年度最受欢迎原创歌手 （获奖）\r\n\r\n▪ 2014-12-15 第8届 中国移动无线音乐咪咕汇年度网络最具人气男歌手 （获奖）\r\n\r\n▪ 2013-12-08 第7届 中国移动无线音乐咪咕汇最佳人气男歌手 （获奖）\r\n\r\n▪ 2013-04-20 第17届 全球华语榜中榜颁奖盛典传媒推荐歌手 （获奖）\r\n\r\n▪ 2013-03-30 第20届 东方风云榜年度十大金曲 幻听 （获奖）\r\n\r\n▪ 2013-03-30 第20届 东方风云榜最佳唱作人 （获奖）\r\n\r\n▪ 2012-12-29 第20届 中国歌曲排行榜年度金曲 幻听 （获奖）\r\n\r\n▪ 2012-12-10 2012 亚洲时尚盛典年度时尚原创音乐人 （获奖）\r\n\r\n▪ 2012-12-08 第6届 中国移动无线音乐咪咕汇音乐盛典最佳畅销网游金曲 天龙八部之宿敌 （获奖）\r\n\r\n▪ 2012-08-13 2012 Channel[V]华语咪咕榜中榜盛典爱心行动大使 （获奖）\r\n\r\n▪ 2012-05-16 第9届 亚太音乐榜数位专辑销量榜冠军 苏格拉没有底 （获奖）\r\n\r\n▪ 2012-05-16 第9届 亚太音乐榜最受欢迎唱作新锐 （获奖）\r\n\r\n▪ 2012-04-23 第10届 MusicRadio中国TOP排行榜年度推荐唱片 苏格拉没有底 （获奖）\r\n\r\n▪ 2012-04-07 第19届 东方风云榜年度金曲 想象之中 （获奖）\r\n\r\n▪ 2012-04-07 第19届 东方风云榜年度最佳唱作人 （获奖）\r\n\r\n▪ 2012-03 第16届 全球华语榜中榜内地最受欢迎男歌手 （提名）\r\n\r\n▪ 2012-01-19 第19届 中国歌曲排行榜年度金曲 想象之中 （获奖）\r\n\r\n▪ 2012-01-12 第6届 腾讯星光大典内地年度男歌手 （获奖）\r\n\r\n▪ 2011-11-24 第4届 音乐风云榜新人盛典最受欢迎唱作新人 （获奖）\r\n\r\n▪ 2011-10-15 第11届 全球华语歌曲排行榜最受欢迎新人 （获奖）\r\n\r\n▪ 2010-01-10 第4届 腾讯网星光大典年度十大金曲 灰色头像 （获奖）\r\n\r\n其他\r\n\r\n▪ 2008 安徽省十佳青年学生 （获奖）\r\n\r\n▪ 2001 讯飞杯全国中学生网页设计大赛安徽赛区第一名 （获奖）', 'music/2/2.jpg', '1', null);

-- ----------------------------
-- Table structure for singer_type
-- ----------------------------
DROP TABLE IF EXISTS `singer_type`;
CREATE TABLE `singer_type` (
  `type_id` int NOT NULL AUTO_INCREMENT COMMENT '歌手种类id',
  `name` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '种类名称',
  PRIMARY KEY (`type_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 COMMENT='Singer_type歌手种类实体信息';

-- ----------------------------
-- Records of singer_type
-- ----------------------------
INSERT INTO `singer_type` VALUES ('1', '内地');
INSERT INTO `singer_type` VALUES ('2', '港台');
INSERT INTO `singer_type` VALUES ('3', '欧美');
INSERT INTO `singer_type` VALUES ('4', '日本');
INSERT INTO `singer_type` VALUES ('5', '韩国');
INSERT INTO `singer_type` VALUES ('6', '其他');

-- ----------------------------
-- Table structure for song
-- ----------------------------
DROP TABLE IF EXISTS `song`;
CREATE TABLE `song` (
  `song_id` int NOT NULL AUTO_INCREMENT COMMENT '歌曲id',
  `song_title` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '歌曲名称',
  `song_url` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '歌曲路径',
  `album_id` int NOT NULL COMMENT '专辑id',
  `lyric` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '歌词路径',
  `spectrum` varchar(2000) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '歌曲频谱',
  `type_id` int DEFAULT NULL COMMENT '歌曲种类id',
  PRIMARY KEY (`song_id`),
  KEY `album_id` (`album_id`),
  KEY `type_id` (`type_id`),
  CONSTRAINT `song_ibfk_4` FOREIGN KEY (`album_id`) REFERENCES `album` (`album_id`) ON DELETE CASCADE ON UPDATE CASCADE,
  CONSTRAINT `song_ibfk_5` FOREIGN KEY (`type_id`) REFERENCES `song_type` (`type_id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=106 DEFAULT CHARSET=utf8mb3 COMMENT='Song歌曲种类实体信息';

-- ----------------------------
-- Records of song
-- ----------------------------
INSERT INTO `song` VALUES ('1', '七夕', 'music/2/1/song/2sa1as1.mp3', '1', 'music/2/1/lyric/2sa1as1.lrc', null, '1');
INSERT INTO `song` VALUES ('2', '宇宙之大', 'music/2/1/song/2sa1as2.mp3', '1', 'music/2/1/lyric/2sa1as2.lrc', null, '1');
INSERT INTO `song` VALUES ('3', '山水之间', 'music/2/1/song/2sa1as3.mp3', '1', 'music/2/1/lyric/2sa1as3.lrc', null, '1');
INSERT INTO `song` VALUES ('4', '弹指一挥间', 'music/2/1/song/2sa1as4.mp3', '1', 'music/2/1/lyric/2sa1as4.lrc', null, '1');
INSERT INTO `song` VALUES ('5', '惊鸿一面', 'music/2/1/song/2sa1as5.mp3', '1', 'music/2/1/lyric/2sa1as5.lrc', null, '1');
INSERT INTO `song` VALUES ('6', '有桃花', 'music/2/1/song/2sa1as6.mp3', '1', 'music/2/1/lyric/2sa1as6.lrc', null, '1');
INSERT INTO `song` VALUES ('7', '梧桐灯', 'music/2/1/song/2sa1as7.mp3', '1', 'music/2/1/lyric/2sa1as7.lrc', null, '1');
INSERT INTO `song` VALUES ('8', '等到烟火清凉', 'music/2/1/song/2sa1as8.mp3', '1', 'music/2/1/lyric/2sa1as8.lrc', null, '1');
INSERT INTO `song` VALUES ('9', '隐隐约约', 'music/2/1/song/2sa1as9.mp3', '1', 'music/2/1/lyric/2sa1as9.lrc', null, '1');
INSERT INTO `song` VALUES ('10', '不语', 'music/2/2/song/2sa2as10.mp3', '2', 'music/2/2/lyric/2sa2as10.lrc', null, '1');
INSERT INTO `song` VALUES ('11', '书香年华', 'music/2/3/song/2sa3as11.mp3', '3', 'music/2/3/lyric/2sa3as11.lrc', null, '1');
INSERT INTO `song` VALUES ('12', '今年勇', 'music/2/4/song/2sa4as12.mp3', '4', 'music/2/4/lyric/2sa4as12.lrc', null, '1');
INSERT INTO `song` VALUES ('13', '千古', 'music/2/5/song/2sa5as13.mp3', '5', 'music/2/5/lyric/2sa5as13.lrc', null, '1');
INSERT INTO `song` VALUES ('14', '两种悲剧', 'music/2/6/song/2sa6as14.mp3', '6', 'music/2/6/lyric/2sa6as14.lrc', null, '1');
INSERT INTO `song` VALUES ('15', '乱乱唱', 'music/2/6/song/2sa6as15.mp3', '6', 'music/2/6/lyric/2sa6as15.lrc', null, '1');
INSERT INTO `song` VALUES ('16', '伤声', 'music/2/6/song/2sa6as16.mp3', '6', 'music/2/6/lyric/2sa6as16.lrc', null, '1');
INSERT INTO `song` VALUES ('17', '半城烟沙', 'music/2/6/song/2sa6as17.mp3', '6', 'music/2/6/lyric/2sa6as17.lrc', null, '1');
INSERT INTO `song` VALUES ('18', '南山忆', 'music/2/6/song/2sa6as18.mp3', '6', 'music/2/6/lyric/2sa6as18.lrc', null, '1');
INSERT INTO `song` VALUES ('19', '又小雪', 'music/2/6/song/2sa6as19.mp3', '6', 'music/2/6/lyric/2sa6as19.lrc', null, '1');
INSERT INTO `song` VALUES ('20', '天使', 'music/2/6/song/2sa6as20.mp3', '6', 'music/2/6/lyric/2sa6as20.lrc', null, '1');
INSERT INTO `song` VALUES ('21', '安徒生不后悔', 'music/2/6/song/2sa6as21.mp3', '6', 'music/2/6/lyric/2sa6as21.lrc', null, '1');
INSERT INTO `song` VALUES ('22', '安琪', 'music/2/6/song/2sa6as22.mp3', '6', 'music/2/6/lyric/2sa6as22.lrc', null, '1');
INSERT INTO `song` VALUES ('23', '尘世美', 'music/2/6/song/2sa6as23.mp3', '6', 'music/2/6/lyric/2sa6as23.lrc', null, '1');
INSERT INTO `song` VALUES ('24', '我很喜欢', 'music/2/6/song/2sa6as24.mp3', '6', 'music/2/6/lyric/2sa6as24.lrc', null, '1');
INSERT INTO `song` VALUES ('25', '我的Baby', 'music/2/6/song/2sa6as25.mp3', '6', 'music/2/6/lyric/2sa6as25.lrc', null, '1');
INSERT INTO `song` VALUES ('26', '朝舞', 'music/2/6/song/2sa6as26.mp3', '6', 'music/2/6/lyric/2sa6as26.lrc', null, '1');
INSERT INTO `song` VALUES ('27', '看不见的风景', 'music/2/6/song/2sa6as27.mp3', '6', 'music/2/6/lyric/2sa6as27.lrc', null, '1');
INSERT INTO `song` VALUES ('28', '粉色信笺', 'music/2/6/song/2sa6as28.mp3', '6', 'music/2/6/lyric/2sa6as28.lrc', null, '1');
INSERT INTO `song` VALUES ('29', '花满楼', 'music/2/6/song/2sa6as29.mp3', '6', 'music/2/6/lyric/2sa6as29.lrc', null, '1');
INSERT INTO `song` VALUES ('30', '天龙八部之宿敌', 'music/2/7/song/2sa7as30.mp3', '7', 'music/2/7/lyric/2sa7as30.lrc', null, '1');
INSERT INTO `song` VALUES ('31', '如果当时2020', 'music/2/8/song/2sa8as31.mp3', '8', 'music/2/8/lyric/2sa8as31.lrc', null, '1');
INSERT INTO `song` VALUES ('32', '九月清晨', 'music/2/9/song/2sa9as32.mp3', '9', 'music/2/9/lyric/2sa9as32.lrc', null, '1');
INSERT INTO `song` VALUES ('33', '大千世界', 'music/2/9/song/2sa9as33.mp3', '9', 'music/2/9/lyric/2sa9as33.lrc', null, '1');
INSERT INTO `song` VALUES ('34', '如约而至', 'music/2/9/song/2sa9as34.mp3', '9', 'music/2/9/lyric/2sa9as34.lrc', null, '1');
INSERT INTO `song` VALUES ('35', '明智之举', 'music/2/9/song/2sa9as35.mp3', '9', 'music/2/9/lyric/2sa9as35.lrc', null, '1');
INSERT INTO `song` VALUES ('36', '柳成荫', 'music/2/9/song/2sa9as36.mp3', '9', 'music/2/9/lyric/2sa9as36.lrc', null, '1');
INSERT INTO `song` VALUES ('37', '浪', 'music/2/9/song/2sa9as37.mp3', '9', 'music/2/9/lyric/2sa9as37.lrc', null, '1');
INSERT INTO `song` VALUES ('38', '老古董', 'music/2/9/song/2sa9as38.mp3', '9', 'music/2/9/lyric/2sa9as38.lrc', null, '1');
INSERT INTO `song` VALUES ('39', '艺术家们', 'music/2/9/song/2sa9as39.mp3', '9', 'music/2/9/lyric/2sa9as39.lrc', null, '1');
INSERT INTO `song` VALUES ('40', '重复重复', 'music/2/9/song/2sa9as40.mp3', '9', 'music/2/9/lyric/2sa9as40.lrc', null, '1');
INSERT INTO `song` VALUES ('41', '不煽情', 'music/2/10/song/2sa10as41.mp3', '10', 'music/2/10/lyric/2sa10as41.lrc', null, '1');
INSERT INTO `song` VALUES ('42', '单人旅途', 'music/2/10/song/2sa10as42.mp3', '10', 'music/2/10/lyric/2sa10as42.lrc', null, '1');
INSERT INTO `song` VALUES ('43', '叹服', 'music/2/10/song/2sa10as43.mp3', '10', 'music/2/10/lyric/2sa10as43.lrc', null, '1');
INSERT INTO `song` VALUES ('44', '在那不遥远的地方', 'music/2/10/song/2sa10as44.mp3', '10', 'music/2/10/lyric/2sa10as44.lrc', null, '1');
INSERT INTO `song` VALUES ('45', '庐州月', 'music/2/10/song/2sa10as45.mp3', '10', 'music/2/10/lyric/2sa10as45.lrc', null, '1');
INSERT INTO `song` VALUES ('46', '我们的恋爱是对生命的严重浪费', 'music/2/10/song/2sa10as46.mp3', '10', 'music/2/10/lyric/2sa10as46.lrc', null, '1');
INSERT INTO `song` VALUES ('47', '我无所谓', 'music/2/10/song/2sa10as47.mp3', '10', 'music/2/10/lyric/2sa10as47.lrc', null, '1');
INSERT INTO `song` VALUES ('48', '灰色头像', 'music/2/10/song/2sa10as48.mp3', '10', 'music/2/10/lyric/2sa10as48.lrc', null, '1');
INSERT INTO `song` VALUES ('49', '白马非马', 'music/2/10/song/2sa10as49.mp3', '10', 'music/2/10/lyric/2sa10as49.lrc', null, '1');
INSERT INTO `song` VALUES ('50', '小烦恼没什么大不了', 'music/2/11/song/2sa11as50.mp3', '11', 'music/2/11/lyric/2sa11as50.lrc', null, '1');
INSERT INTO `song` VALUES ('51', '情侣装', 'music/2/12/song/2sa12as51.mp3', '12', 'music/2/12/lyric/2sa12as51.lrc', null, '1');
INSERT INTO `song` VALUES ('52', '我乐意', 'music/2/13/song/2sa13as52.mp3', '13', 'music/2/13/lyric/2sa13as52.lrc', null, '1');
INSERT INTO `song` VALUES ('53', '我想牵着你的手', 'music/2/14/song/2sa14as53.mp3', '14', 'music/2/14/lyric/2sa14as53.lrc', null, '1');
INSERT INTO `song` VALUES ('54', '放肆', 'music/2/15/song/2sa15as54.mp3', '15', 'music/2/15/lyric/2sa15as54.lrc', null, '1');
INSERT INTO `song` VALUES ('55', '断桥残雪', 'music/2/16/song/2sa16as55.mp3', '16', 'music/2/16/lyric/2sa16as55.lrc', null, '1');
INSERT INTO `song` VALUES ('56', 'Play With Style', 'music/2/17/song/2sa17as56.mp3', '17', 'music/2/17/lyric/2sa17as56.lrc', null, '1');
INSERT INTO `song` VALUES ('57', '亲情式的爱情', 'music/2/17/song/2sa17as57.mp3', '17', 'music/2/17/lyric/2sa17as57.lrc', null, '1');
INSERT INTO `song` VALUES ('58', '伴虎', 'music/2/17/song/2sa17as58.mp3', '17', 'music/2/17/lyric/2sa17as58.lrc', null, '1');
INSERT INTO `song` VALUES ('59', '全球变冷', 'music/2/17/song/2sa17as59.mp3', '17', 'music/2/17/lyric/2sa17as59.lrc', null, '1');
INSERT INTO `song` VALUES ('60', '对话老师', 'music/2/17/song/2sa17as60.mp3', '17', 'music/2/17/lyric/2sa17as60.lrc', null, '1');
INSERT INTO `song` VALUES ('61', '幻听', 'music/2/17/song/2sa17as61.mp3', '17', 'music/2/17/lyric/2sa17as61.lrc', null, '1');
INSERT INTO `song` VALUES ('62', '心疼你的过去', 'music/2/17/song/2sa17as62.mp3', '17', 'music/2/17/lyric/2sa17as62.lrc', null, '1');
INSERT INTO `song` VALUES ('63', '胡萝卜须', 'music/2/17/song/2sa17as63.mp3', '17', 'music/2/17/lyric/2sa17as63.lrc', null, '1');
INSERT INTO `song` VALUES ('64', '装糊涂', 'music/2/17/song/2sa17as64.mp3', '17', 'music/2/17/lyric/2sa17as64.lrc', null, '1');
INSERT INTO `song` VALUES ('65', '闺蜜', 'music/2/17/song/2sa17as65.mp3', '17', 'music/2/17/lyric/2sa17as65.lrc', null, '1');
INSERT INTO `song` VALUES ('66', '江湖', 'music/2/18/song/2sa18as66.mp3', '18', 'music/2/18/lyric/2sa18as66.lrc', null, '1');
INSERT INTO `song` VALUES ('67', '深夜书店', 'music/2/19/song/2sa19as67.mp3', '19', 'music/2/19/lyric/2sa19as67.lrc', null, '1');
INSERT INTO `song` VALUES ('68', '素颜', 'music/2/21/song/2sa21as68.mp3', '21', 'music/2/21/lyric/2sa21as68.lrc', null, '1');
INSERT INTO `song` VALUES ('69', '绝代风华', 'music/2/22/song/2sa22as69.mp3', '22', 'music/2/22/lyric/2sa22as69.lrc', null, '1');
INSERT INTO `song` VALUES ('70', '羡慕', 'music/2/23/song/2sa23as70.mp3', '23', 'music/2/23/lyric/2sa23as70.lrc', null, '1');
INSERT INTO `song` VALUES ('71', '内线', 'music/2/24/song/2sa24as71.mp3', '24', 'music/2/24/lyric/2sa24as71.lrc', null, '1');
INSERT INTO `song` VALUES ('72', '坏孩子', 'music/2/24/song/2sa24as72.mp3', '24', 'music/2/24/lyric/2sa24as72.lrc', null, '1');
INSERT INTO `song` VALUES ('73', '城府', 'music/2/24/song/2sa24as73.mp3', '24', 'music/2/24/lyric/2sa24as73.lrc', null, '1');
INSERT INTO `song` VALUES ('74', '多余的解释', 'music/2/24/song/2sa24as74.m4a', '24', 'music/2/24/lyric/2sa24as74.lrc', null, '1');
INSERT INTO `song` VALUES ('75', '如果当时', 'music/2/24/song/2sa24as75.mp3', '24', 'music/2/24/lyric/2sa24as75.lrc', null, '1');
INSERT INTO `song` VALUES ('76', '星座书上', 'music/2/24/song/2sa24as76.mp3', '24', 'music/2/24/lyric/2sa24as76.lrc', null, '1');
INSERT INTO `song` VALUES ('77', '有何不可', 'music/2/24/song/2sa24as77.mp3', '24', 'music/2/24/lyric/2sa24as77.lrc', null, '1');
INSERT INTO `song` VALUES ('78', '清明雨上', 'music/2/24/song/2sa24as78.mp3', '24', 'music/2/24/lyric/2sa24as78.lrc', null, '1');
INSERT INTO `song` VALUES ('79', '认错', 'music/2/24/song/2sa24as79.mp3', '24', 'music/2/24/lyric/2sa24as79.lrc', null, '1');
INSERT INTO `song` VALUES ('80', '医生', 'music/2/25/song/2sa25as80.mp3', '25', 'music/2/25/lyric/2sa25as80.lrc', null, '1');
INSERT INTO `song` VALUES ('81', '千百度', 'music/2/25/song/2sa25as81.mp3', '25', 'music/2/25/lyric/2sa25as81.lrc', null, '1');
INSERT INTO `song` VALUES ('82', '双人旁', 'music/2/25/song/2sa25as82.mp3', '25', 'music/2/25/lyric/2sa25as82.lrc', null, '1');
INSERT INTO `song` VALUES ('83', '微博控', 'music/2/25/song/2sa25as83.mp3', '25', 'music/2/25/lyric/2sa25as83.lrc', null, '1');
INSERT INTO `song` VALUES ('84', '想象之中', 'music/2/25/song/2sa25as84.mp3', '25', 'music/2/25/lyric/2sa25as84.lrc', null, '1');
INSERT INTO `song` VALUES ('85', '拆东墙', 'music/2/25/song/2sa25as85.mp3', '25', 'music/2/25/lyric/2sa25as85.lrc', null, '1');
INSERT INTO `song` VALUES ('86', '敬酒不吃', 'music/2/25/song/2sa25as86.mp3', '25', 'music/2/25/lyric/2sa25as86.lrc', null, '1');
INSERT INTO `song` VALUES ('87', '毁人不倦', 'music/2/25/song/2sa25as87.mp3', '25', 'music/2/25/lyric/2sa25as87.lrc', null, '1');
INSERT INTO `song` VALUES ('88', '河山大好', 'music/2/25/song/2sa25as88.mp3', '25', 'music/2/25/lyric/2sa25as88.lrc', null, '1');
INSERT INTO `song` VALUES ('89', '降温', 'music/2/25/song/2sa25as89.mp3', '25', 'music/2/25/lyric/2sa25as89.lrc', null, '1');
INSERT INTO `song` VALUES ('90', '蝴蝶的时间', 'music/2/26/song/2sa26as90.mp3', '26', 'music/2/26/lyric/2sa26as90.lrc', null, '1');
INSERT INTO `song` VALUES ('91', '违章动物', 'music/2/27/song/2sa27as91.mp3', '27', 'music/2/27/lyric/2sa27as91.lrc', null, '1');
INSERT INTO `song` VALUES ('92', '送你的独白', 'music/2/28/song/2sa28as92.mp3', '28', 'music/2/28/lyric/2sa28as92.lrc', null, '1');
INSERT INTO `song` VALUES ('93', '通关', 'music/2/29/song/2sa29as93.mp3', '29', 'music/2/29/lyric/2sa29as93.lrc', null, '1');
INSERT INTO `song` VALUES ('94', '雨幕', 'music/2/30/song/2sa30as94.mp3', '30', 'music/2/30/lyric/2sa30as94.lrc', null, '1');
INSERT INTO `song` VALUES ('95', '雪花谣', 'music/2/31/song/2sa31as95.mp3', '31', 'music/2/31/lyric/2sa31as95.lrc', null, '1');
INSERT INTO `song` VALUES ('96', '奇谈', 'music/2/32/song/2sa32as96.mp3', '32', 'music/2/32/lyric/2sa32as96.lrc', null, '1');
INSERT INTO `song` VALUES ('97', '平行宇宙', 'music/2/32/song/2sa32as97.mp3', '32', 'music/2/32/lyric/2sa32as97.lrc', null, '1');
INSERT INTO `song` VALUES ('98', '幻胖', 'music/2/32/song/2sa32as98.mp3', '32', 'music/2/32/lyric/2sa32as98.lrc', null, '1');
INSERT INTO `song` VALUES ('99', '摄影艺术', 'music/2/32/song/2sa32as99.mp3', '32', 'music/2/32/lyric/2sa32as99.lrc', null, '1');
INSERT INTO `song` VALUES ('100', '摆脱', 'music/2/32/song/2sa32as100.mp3', '32', 'music/2/32/lyric/2sa32as100.lrc', null, '1');
INSERT INTO `song` VALUES ('101', '早睡身体好', 'music/2/32/song/2sa32as101.mp3', '32', 'music/2/32/lyric/2sa32as101.lrc', null, '1');
INSERT INTO `song` VALUES ('102', '最佳歌手', 'music/2/32/song/2sa32as102.mp3', '32', 'music/2/32/lyric/2sa32as102.lrc', null, '1');
INSERT INTO `song` VALUES ('103', '燕归巢', 'music/2/32/song/2sa32as103.mp3', '32', 'music/2/32/lyric/2sa32as103.lrc', null, '1');
INSERT INTO `song` VALUES ('104', '雅俗共赏', 'music/2/32/song/2sa32as104.mp3', '32', 'music/2/32/lyric/2sa32as104.lrc', null, '1');
INSERT INTO `song` VALUES ('105', '飞驰于你', 'music/2/33/song/2sa33as105.mp3', '33', 'music/2/33/lyric/2sa33as105.lrc', null, '1');

-- ----------------------------
-- Table structure for song_type
-- ----------------------------
DROP TABLE IF EXISTS `song_type`;
CREATE TABLE `song_type` (
  `type_id` int NOT NULL AUTO_INCREMENT COMMENT '歌曲种类id',
  `name` varchar(255) DEFAULT NULL COMMENT '歌曲种类名称',
  PRIMARY KEY (`type_id`)
) ENGINE=InnoDB AUTO_INCREMENT=7 DEFAULT CHARSET=utf8mb3 COMMENT='Song_Type歌曲种类实体信息';

-- ----------------------------
-- Records of song_type
-- ----------------------------
INSERT INTO `song_type` VALUES ('1', '内地');
INSERT INTO `song_type` VALUES ('2', '港台');
INSERT INTO `song_type` VALUES ('3', '欧美');
INSERT INTO `song_type` VALUES ('4', '日本');
INSERT INTO `song_type` VALUES ('5', '韩国');
INSERT INTO `song_type` VALUES ('6', '其他');

-- ----------------------------
-- Table structure for user
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int NOT NULL AUTO_INCREMENT COMMENT '用户id',
  `username` varchar(20) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '用户名',
  `sex` enum('男','女') CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT '男' COMMENT '性别',
  `psw` varchar(16) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL COMMENT '密码',
  `head_portrait` varchar(255) CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT NULL COMMENT '头像路径',
  `vip` enum('true','false') CHARACTER SET utf8 COLLATE utf8_general_ci DEFAULT 'false' COMMENT 'vip属性',
  `viptime` int DEFAULT NULL COMMENT 'vip过期时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=1007 DEFAULT CHARSET=utf8mb3 COMMENT='User用户实体信息';

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1001', '张三', '男', '123456', 'User/head/14f333378c173e86f0ff7c2ca7bbb03d.jpeg', 'false', null);
INSERT INTO `user` VALUES ('1002', '李四', '男', '123456', 'User/head/1f756751a5db0d7ff538b6bb1097ad4c.jpeg', 'false', null);
INSERT INTO `user` VALUES ('1003', '赵六', '男', '123456', 'User/head/2275e0669d4f94e4106311165c28c0e3.jpeg', 'false', null);
INSERT INTO `user` VALUES ('1004', '王五', null, '123456', 'User/head/f59619afdf2ff0f76ff3b63838f6d19a.jpeg', null, null);
INSERT INTO `user` VALUES ('1005', '死胖子', null, '123456', 'User/head/f59619afdf2ff0f76ff3b63838f6d19a.jpeg', null, null);
INSERT INTO `user` VALUES ('1006', '小七', null, '123456', 'User/head/f59619afdf2ff0f76ff3b63838f6d19a.jpeg', null, null);

-- ----------------------------
-- Table structure for work_type
-- ----------------------------
DROP TABLE IF EXISTS `work_type`;
CREATE TABLE `work_type` (
  `work_id` int NOT NULL AUTO_INCREMENT COMMENT '种类id',
  `name` varchar(20) NOT NULL COMMENT '种类名称',
  PRIMARY KEY (`work_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb3 COMMENT='Work_Type作品种类实体信息';

-- ----------------------------
-- Records of work_type
-- ----------------------------
